Repository: rffontenelle/rpminspect-l10n
Catalog: *.po
Languages: pt_br

source: Scan extracted and patched source code files, scripts, and RPM spec files for any prohibited Unicode code points, as defined in the configuration file. Any prohibited code points are reported as a possible security risk.
pt_br: Verifica arquivos de código-fonte extraídos e corrigidos, scripts e arquivos de especificação RPM em busca de pontos de código Unicode proibidos, conforme definido no arquivo de configuração. Quaisquer pontos de código proibidos são relatados como um possível risco à segurança.

source: Check for correct RPM dependency metadata. Report incorrect or conflicting findings as well as expected changes when comparing a new build to an older build. Changes are only reported when comparing builds, but this inspection will check for correct RPM dependency metadata when inspecting a single build and report findings.
pt_br: Verifica os metadados de dependência de RPM corretos. Relata descobertas incorretas ou conflitantes, bem como alterações esperadas ao comparar uma versão nova com uma versão mais antiga. As alterações são relatadas apenas ao comparar compilações, mas esta inspeção verificará os metadados corretos de dependência de RPM ao inspecionar uma única compilação e relatará as descobertas.

source: Checks that files in RPM packages have their debugging symbols stripped and files in debuginfo packages carry debugging symbols. When comparing builds, report where symbols unexpectedly appear or disappear and what corrective action is needed.
pt_br: Verifica se os arquivos em pacotes RPM têm seus símbolos de depuração removidos e se os arquivos em pacotes debuginfo carregam símbolos de depuração. Ao comparar compilações, informa onde os símbolos aparecem ou desaparecem inesperadamente e quais ações corretivas são necessárias.

source: Perform syntax check on udev rules files using udevadm verify.
pt_br: Executa a verificação de sintaxe nos arquivos de regras do udev usando udevadm verify.

source: Change the string specified on the 'Vendor:' line in the spec file.
pt_br: Altere a string especificada na linha 'Vendor:' no arquivo spec.

source: Make sure the SRPM is built on a host within the expected subdomain.
pt_br: Certifique-se de que o SRPM seja compilado em um host dentro do subdomínio esperado.

source: Unprofessional language as defined in the configuration file was found in the text shown. Remove or change the offending words and rebuild.
pt_br: Linguagem não profissional conforme definida no arquivo de configuração foi encontrada no texto mostrado. Remova ou altere as palavras ofensivas e recompile.

source: Check to see if you eliminated a subpackage but still have the %package and/or the %files section for it.
pt_br: Verifique se você eliminou um subpacote, mas ainda possui a seção %package e/ou %files para ele.

source: The License tag must contain an approved license string as defined by the distribution (e.g., GPLv2+). If the license in question is approved, the license database needs updating in the rpminspect-data package.
pt_br: A tag License deve conter uma sequência de licença aprovada conforme definido pela distribuição (por exemplo, GPLv2+). Se a licença em questão é aprovada, o banco de dados de licenças precisará ser atualizado no pacote rpminspect-data.

source: Make sure the licensedb setting in the rpminspect configuration is set to a valid licensedb file. This is also commonly due to a missing vendor specific rpminspect-data package on the system.
pt_br: Certifique-se de que a configuração do licensedb na configuração do rpminspect esteja definida como um arquivo licensedb válido. Isso também geralmente ocorre devido à falta de um pacote rpminspect-data específico do fornecedor no sistema.

source: The specified license abbreviation is not listed as approved in the license database. The license database is specified in the rpminspect configuration file. Check this file and send a pull request to the appropriate upstream project to update the database. If the license is listed in the database but marked unapproved, you may need to work with the legal team regarding options for this software.
pt_br: A abreviatura de licença especificada não está listada como aprovada no banco de dados de licenças. O banco de dados de licença é especificado no arquivo de configuração rpminspect. Verifique este arquivo e envie uma pull request ao projeto upstream apropriado para atualizar o banco de dados. Se a licença estiver listada no banco de dados, mas marcada como não aprovada, talvez seja necessário trabalhar com a equipe jurídica (Legal Team) em relação às opções para este software.

source: Ensure all object files are compiled with -fPIC
pt_br: Certifique-se de que todos os arquivos objeto sejam compilados com -fPIC

source: Ensure that the package is being built with the correct compiler and compiler flags
pt_br: Certifique-se de que o pacote esteja sendo compilado com o compilador e sinalizadores de compilador corretos

source: The data in an ELF file appears to be corrupt; ensure that packaged ELF files are not being truncated or incorrectly modified
pt_br: Os dados em um arquivo ELF parecem estar corrompidos; certifique-se que os arquivos ELF empacotados não estejam sendo truncados ou modificados incorretamente

source: An ELF stack is marked as executable. Ensure that no execstack options are being passed to the linker, and that no functions are defined on the stack.
pt_br: Uma pilha ELF é marcada como executável. Certifique-se de que nenhuma opção execstack esteja sendo passada para o vinculador e que nenhuma função esteja definida na pilha.

source: Ensure executables are linked with with '-z relro -z now'
pt_br: Certifique-se de que os executáveis estão vinculados a '-z relro -z now'

source: Correct the errors in the man page as reported by the libmandoc parser.
pt_br: Corrija os erros na página man conforme relatado pelo analisador libmandoc.

source: Correct the installation path for the man page. Man pages must be installed in the directory beneath /usr/share/man that matches the section number of the page.
pt_br: Corrija o caminho de instalação da página man. As páginas man devem ser instaladas no diretório abaixo de /usr/share/man que corresponda ao número da seção da página.

source: Correct the reported errors in the XML document
pt_br: Corrija os erros relatados no documento XML

source: Refer to the Desktop Entry Specification at https://standards.freedesktop.org/desktop-entry-spec/latest/ for help correcting the errors and warnings
pt_br: Consulte a especificação de entrada de desktop em https://standards.freedesktop.org/desktop-entry-spec/latest/ para obter ajuda na correção de erros e avisos

source: The Release: tag in the spec file must include a '%{?dist}' string. Please add this to the spec file per the distribution packaging guidelines.
pt_br: A tag Release: no arquivo spec deve incluir uma string '%{?dist}'. Adicione isso ao arquivo spec de acordo com as diretrizes de empacotamento de distribuição.

source: The spec file name does not match the expected NAME.spec format. Rename the spec file to conform to this policy.
pt_br: O nome do arquivo spec não corresponde ao formato NOME.spec esperado. Renomeie o arquivo spec para estar em conformidade com esta política.

source: This package is part of a module but is missing the %{modularitylabel} header tag. Add this as a %define in the spec file and rebuild.
pt_br: Este pacote faz parte de um módulo, mas não possui a tag de cabeçalho %{modularitylabel}. Adicione isso como %define no arquivo spec e recompile.

source: This build either contains a valid or invalid /data/static_context setting. Refer to the module rules for the product you are building to determine what the setting should be. The rpminspect configuration settings also set the rules determining if the /data/static_context setting is required, forbidden, or recommend.
pt_br: Esta compilação contém uma configuração /data/static_context válida ou inválida. Consulte as regras do módulo do produto que você está compilando para determinar qual deve ser a configuração. As definições de configuração do rpminspect também definem as regras que determinam se a configuração /data/static_context é necessária, proibida ou recomendada.

source: The Java bytecode version for one or more class files in the build was not met for the product release. Ensure you are using the correct JDK for the build.
pt_br: A versão do bytecode Java para um ou mais arquivos de classe na compilação não foi atendida na liberação do produto. Certifique-se de estar usando o JDK correto para a compilação.

source: File changes were found. In most cases these are expected, but it is a good idea to verify the changes found are deliberate.
pt_br: Foram encontradas alterações no arquivo. Na maioria dos casos, isto é esperado, mas é uma boa ideia verificar se as alterações encontradas são deliberadas.

source: Unexpected file moves were found. Verify these changes are correct. If they are not, adjust the build to prevent the file moves between builds.
pt_br: Foram encontradas movimentações inesperadas de arquivos. Verifique se essas alterações estão corretas. Se não estiverem, ajuste a compilação para evitar que o arquivo seja movido entre as compilações.

source: Unexpected file removals were found. Verify these changes are correct. If they are not, adjust the build to prevent the file removals between builds.
pt_br: Foram encontradas remoções inesperadas de arquivos. Verifique se essas alterações estão corretas. Se não estiverem, ajuste a compilação para evitar remoções de arquivos entre compilações.

source: Unexpected file additions were found. Verify these changes are correct. If they are not, adjust the build to prevent the file additions between builds. If they are correct, update %s and send a patch to the rpminspect data project owning that file so rpminspect knows to expect this change. You may also need to update the data package or local configuration file and change the forbidden_path_prefixes or forbidden_path_suffixes list.
pt_br: Adições inesperadas de arquivos foram encontradas. Verifique se essas alterações estão corretas. Se não estiverem, ajuste a compilação para evitar adições de arquivos entre compilações. Se estiverem corretos, atualize %s e envie um patch para o projeto de dados rpminspect que possui esse arquivo para que o rpminspect saiba que pode esperar essa mudança. Você também pode precisar atualizar o pacote de dados ou o arquivo de configuração local e alterar a lista de forbidden_path_prefixes ou forbidden_path_suffixes.

source: Unexpected changed source archive content. The version of the package did not change between builds, but the source archive content did. This may be deliberate, but needs inspection. If this change is expected, update %s and send a patch to the project that owns that file.
pt_br: Conteúdo do arquivo fonte alterado inesperadamente. A versão do pacote não mudou entre as compilações, mas o conteúdo do arquivo fonte sim. Isto pode ser deliberado, mas precisa de inspeção. Se esta alteração for esperada, atualize %s e envie um patch para o projeto que possui esse arquivo.

source: Make sure the %%files section includes the %%defattr macro. If these permissions are expected, update %s and send a patch to the project that owns it.
pt_br: Certifique-se de que a seção %%files inclua a macro %%defattr. Se essas permissões forem esperadas, atualize %s e envie um patch para o projeto que contenha isso.

source: Bin path files must be owned by the bin_owner set in the rpminspect configuration, which is usually root. If this ownership is expected, update %s and send a patch to the project that owns it.
pt_br: Os arquivos de caminho bin devem pertencer ao bin_owner definido na configuração do rpminspect, que geralmente é root. Se esta propriedade for esperada, atualize %s e envie um patch para o projeto que contenha isso.

source: Bin path files must be owned by the bin_group set in the rpminspect configuration, which is usually root. If this ownership is expect, update %s and send a patch to the project that owns it.
pt_br: Os arquivos de caminho bin devem pertencer ao bin_group definido na configuração do rpminspect, que geralmente é root. Se esta propriedade for esperada, atualize %s e envie um patch para o projeto que o possui.

source: Either chgrp the file to the bin_group set in the rpminspect configuration or remove the world execute bit on the file (chmod o-x). If this ownership is expected, update %s and send a patch to the project that owns it.
pt_br: Faça chgrp do arquivo para bin_group definido na configuração do rpminspect ou remova o bit de execução mundial do arquivo (chmod o-x). Se esta propriedade for esperada, atualize %s e envie um patch para o projeto que contenha isso.

source: Either chgrp the file to the bin_group set in the rpminspect configuration or remove the group write bit on the file (chmod g-w). If this ownership is expected, update %s and send a patch to the project that owns it.
pt_br: Use chgrp no arquivo para bin_group definido na configuração do rpminspect ou remova o bit de gravação do grupo no arquivo (chmod g-w). Se esta propriedade for esperada, atualize %s e envie um patch para o projeto que contenha isso.

source: Verify the ownership changes are expected. If not, adjust the package build process to set correct owner and group information. If expected, update %s and send a patch to the project that owns it.
pt_br: Verifique se as mudanças de propriedade são esperadas. Caso contrário, ajuste o processo de compilação do pacote para definir as informações corretas do proprietário e do grupo. Se esperado, atualize %s e envie um patch para o projeto que contenha isso.

source: rpminspect is expecting a fileinfo rule from the vendor data package for this file. Usually this means the file carries a non-standard set of permissions (e.g., setuid) which is a condition where rpminspect would check the fileinfo list to ensure the package conforms to the vendor rules. To remedy, add a fileinfo rule for this file to the vendor data package under the appropriate product release file.
pt_br: O rpminspect está esperando uma regra fileinfo do pacote de dados do fornecedor para este arquivo. Normalmente, isso significa que o arquivo carrega um conjunto de permissões não padrão (por exemplo, setuid), que é uma condição em que o rpminspect verificaria a lista de informações do arquivo para garantir que o pacote esteja em conformidade com as regras do fornecedor. Para remediar, adicione uma regra fileinfo para esse arquivo ao pacote de dados do fornecedor no arquivo de versão do produto apropriado.

source: Consult the shell documentation for proper syntax.
pt_br: Consulte a documentação do shell para obter a sintaxe correta.

source: The file referenced was not a known shell script in the before build but is now a shell script in the after build.
pt_br: O arquivo referenciado não era um script de shell conhecido na compilação anterior, mas agora é um script de shell na compilação posterior.

source: The referenced shell script is invalid. Consider debugging it with the '-n' option on the shell to find and fix the problem.
pt_br: O script de shell referenciado é inválido. Considere depurá-lo com a opção '-n' no shell para localizar e corrigir o problema.

source: See annocheck(1) for more information.
pt_br: Veja annocheck(1) para mais informações.

source: Ensure all object files are compiled with '-O2 -D_FORTIFY_SOURCE=2', and that all appropriate headers are included (no implicit function declarations). Symbols may also appear as unfortified if the compiler is unable to determine the size of a buffer, which is not necessarily an error.
pt_br: Certifique-se de que todos os arquivos de objeto sejam compilados com '-O2 -D_FORTIFY_SOURCE=2' e que todos os cabeçalhos apropriados sejam incluídos (sem declarações de função implícitas). Os símbolos também podem parecer não fortificados se o compilador não for capaz de determinar o tamanho de um buffer, o que não é necessariamente um erro.

source: DT_NEEDED symbols have been added or removed. This happens when the build environment has different versions of the required libraries. Sometimes this is deliberate but sometimes not. Verify these changes are expected. If they are not, modify the package spec file to ensure the build links with the correct shared libraries.
pt_br: Símbolos DT_NEEDED foram adicionados ou removidos. Isso acontece quando o ambiente de compilação possui versões diferentes das bibliotecas necessárias. Às vezes isso é deliberado, mas às vezes não. Verifique se essas alterações são esperadas. Se não estiverem, modifique o arquivo spec do pacote para garantir que a compilação esteja vinculada às bibliotecas compartilhadas corretas.

source: A file grew by a noticeable amount. Ensure this change is intended. If it is, you can adjust the filesize inspection settings in the rpminspect.yaml file.
pt_br: Um arquivo cresceu bastante. Certifique-se de que esta alteração seja intencional. Se estiver, você pode ajustar as configurações de inspeção de tamanho de arquivo no arquivo rpminspect.yaml.

source: A file shrank by a noticeable amount. Ensure this change is intended. If it is, you can adjust the filesize inspection settings in the rpminspect.yaml file.
pt_br: Um arquivo encolheu bastante. Certifique-se de que esta alteração seja intencional. Se estiver, você pode ajustar as configurações de inspeção de tamanho de arquivo no arquivo rpminspect.yaml.

source: A previously empty file is no longer empty. Make sure this change is intended and fix the package spec file if necessary.
pt_br: Um arquivo anteriormente vazio não está mais vazio. Certifique-se de que essa alteração seja intencional e corrija o arquivo spec do pacote, se necessário.

source: A previously non-empty file is now empty. Make sure this change is intended and fix the package space file if necessary.
pt_br: Um arquivo anteriormente não vazio agora está vazio. Certifique-se de que essa alteração seja intencional e corrija o arquivo de espaço do pacote, se necessário.

source: Unexpected capabilities were found on the indicated file. Consult capabilities(7) and either adjust the files in the package or modify the capabilities list in the rpminspect vendor data package. The security team may also be of help for this situation. If necessary, update %s with the changes found here and send a patch to the project that owns the data file.
pt_br: Recursos inesperados foram encontrados no arquivo indicado. Consulte capabilities(7) e ajuste os arquivos no pacote ou modifique a lista de capacidades no pacote de dados de fornecedores do rpminspect. A equipe de segurança também pode ajudar nesta situação. Se necessário, atualize %s com as alterações encontradas aqui e envie um patch para o projeto que possui o arquivo de dados.

source: Kernel module parameters were removed between builds. This may present usability problems for users if module parameters were removed in a maintenance update.
pt_br: Os parâmetros de módulo do kernel foram removidos entre as compilações. Isto pode apresentar problemas de usabilidade para os usuários se os parâmetros de módulo forem removidos em uma atualização de manutenção.

source: Kernel module dependencies changed between builds. This may present usability problems for users if module dependencies changed in a maintenance update.
pt_br: Dependências do módulo do kernel alteradas entre compilações. Isto pode apresentar problemas de usabilidade para os usuários se as dependências do módulo forem alteradas em uma atualização de manutenção.

source: Kernel module device aliases changed between builds. This may present usability problems for users if module device aliases changed in a maintenance update.
pt_br: Apelidos de dispositivos do módulo kernel alterados entre compilações. Isso pode apresentar problemas de usabilidade para os usuários se os aliases dos dispositivos do módulo forem alterados em uma atualização de manutenção.

source: An architecture present in the before build is now missing in the after build. This may be deliberate, but check to make sure you do not have any unexpected ExclusiveArch lines in the spec file.
pt_br: Uma arquitetura presente na compilação anterior agora está faltando na compilação posterior. Isso pode ser deliberado, mas verifique se você não possui nenhuma linha ExclusiveArch inesperada no arquivo spec.

source: A new architecture has appeared in the after build. This may indicate progress in the world of computing.
pt_br: Uma nova arquitetura apareceu após a compilação. Isto pode indicar progresso no mundo da computação.

source: A subpackage present in the before build is now missing in the after build. This may be deliberate, but check to make sure you have correct syntax defining the subpackage in the spec file
pt_br: Um subpacote presente na compilação anterior agora está ausente na compilação posterior. Isso pode ser deliberado, mas verifique se você possui a sintaxe correta definindo o subpacote no arquivo spec

source: A new subpackage has appeared in the after build. This may indicate progress in the world of computing.
pt_br: Um novo subpacote apareceu após a compilação. Isso pode indicar progresso no mundo da computação.

source: Make sure the spec file in the after build contains a valid %changelog section.
pt_br: Certifique-se de que o arquivo spec na compilação posterior contenha uma seção %changelog válida.

source: Files should not be installed in old directory names. Modify the package to install the affected file to the preferred directory.
pt_br: Os arquivos não devem ser instalados em nomes de diretórios antigos. Modifique o pacote para instalar o arquivo afetado no diretório preferido.

source: ELF .o and .a files should not carry LTO (Link Time Optimization) bytecode. Make sure you have stripped LTO bytecode from those files at install time.
pt_br: Os arquivos ELF .o e .a não devem conter bytecode LTO (Link Time Optimization). Certifique-se de ter removido o bytecode LTO desses arquivos no momento da instalação.

source: Make sure symlinks point to a valid destination in one of the subpackages of the build; dangling symlinks are not allowed. If you are comparing builds and have a non-symlink turn in to a symlink, ensure this is deliberate. NOTE: You cannot turn a directory in to a symlink due to RPM limitations.
pt_br: Certifique-se de que os links simbólicos apontem para um destino válido em um dos subpacotes da compilação; links simbólicos pendentes (dangling) não são permitidos. Se você estiver comparando compilações e um link não simbólico se transformar em um link simbólico, certifique-se de que isso seja deliberado. NOTA: Você não pode transformar um diretório em um link simbólico devido às limitações do RPM.
