Repository: rffontenelle/rpminspect-l10n
Catalog: *.po
Languages: pt_br

source: abidiff usage error
pt_br: erro de uso do abidiff

source: ABI change in ${FILE} on ${ARCH}
pt_br: Alteração de ABI em ${FILE} em ${ARCH}

source: ABI incompatible change in ${FILE} on ${ARCH}
pt_br: Alteração incompatível com ABI em ${FILE} em ${ARCH}

source: Comparing old vs. new version of %s in package %s with ABI compatibility level %ld on %s revealed ABI differences.
pt_br: Comparar a versão antiga com a nova de %s no pacote %s com o nível de compatibilidade da ABI %ld em %s revelou diferenças de ABI.

source: Comparing old vs. new version of %s in package %s on %s revealed ABI differences.
pt_br: A comparação da versão antiga com a nova de %s no pacote %s em %s revelou diferenças de ABI.

source: Comparing from %s to %s in package %s with ABI compatibility level %ld on %s revealed ABI differences.
pt_br: A comparação de %s com %s no pacote %s com nível de compatibilidade ABI %ld em %s revelou diferenças de ABI.

source: Comparing from %s to %s in package %s on %s revealed ABI differences.
pt_br: A comparação de %s com %s no pacote %s em %s revelou diferenças de ABI.

source: Command: %s %s
pt_br: Comando: %s %s

source: Packages should not contain files or directories starting with `%s` on %s in %s: %s
pt_br: Os pacotes não devem conter arquivos ou diretórios começando com `%s` em %s em %s: %s

source: invalid directory ${FILE} on ${ARCH}
pt_br: diretório inválido ${FILE} em ${ARCH}

source: Packages should not contain files or directories ending with `%s` on %s in %s: %s
pt_br: Os pacotes não devem conter arquivos ou diretórios que terminem com `%s` em %s em %s: %s

source: Forbidden directory `%s` found on %s in %s: %s
pt_br: Diretório proibido `%s` encontrado em %s em %s: %s

source: forbidden directory ${FILE} on ${ARCH}
pt_br: diretório proibido ${FILE} em ${ARCH}

source: New security-related file `%s` added on %s in %s requires inspection by the Security Team
pt_br: Novo arquivo relacionado à segurança `%s` adicionado em %s em %s requer inspeção pela Equipe de Segurança

source: new security-related file ${FILE} on ${ARCH}
pt_br: novo arquivo relacionado à segurança ${FILE} em ${ARCH}

source: `%s` added on %s in %s
pt_br: `%s` adicionado em %s em %s

source: new file ${FILE} on ${ARCH}
pt_br: novo arquivo ${FILE} em ${ARCH}

source: the fileinfo list
pt_br: a lista fileinfo

source: NOT RUN
pt_br: NÃO EXECUTAR

source: PASSED
pt_br: PASSOU

source: FAILED
pt_br: FALHOU

source: MAYBE
pt_br: TALVEZ

source: skipped
pt_br: pulado

source: UNKNOWN
pt_br: DESCONHECIDO

source: *** before libannocheck_run_tests: %s (%d)
pt_br: *** antes de libannocheck_run_tests: %s (%d)

source: *** after libannocheck_run_tests: %s (%d)
pt_br: *** após libannocheck_run_tests: %s (%d)

source: lost -D_FORTIFY_SOURCE in ${FILE} on ${ARCH}
pt_br: perdeu -D_FORTIFY_SOURCE em ${FILE} em ${ARCH}

source: %s may have lost -O2 -D_FORTIFY_SOURCE on %s
pt_br: %s pode ter perdido -O2 -D_FORTIFY_SOURCE em %s

source: libannocheck '%s' continues passing for %s on %s
pt_br: libannocheck '%s' continua passando para %s em %s

source: libannocheck '%s' test now passes for %s on %s
pt_br: O teste libannocheck '%s' agora passa para %s em %s

source: libannocheck '%s' test now fails for %s on %s
pt_br: O teste libannocheck '%s' agora falha para %s em %s

source: libannocheck '%s' test fails for %s on %s
pt_br: O teste libannocheck '%s' falha para %s em %s

source: libannocheck '%s' test passes for %s on %s
pt_br: O teste libannocheck '%s' passa para %s em %s

source: annocheck '%s' test passes for %s on %s
pt_br: O teste annocheck '%s' passa para %s em %s

source: annocheck '%s' test now passes for %s on %s
pt_br: O teste annocheck '%s' agora passa para %s em %s

source: annocheck '%s' test now fails for %s on %s
pt_br: O teste annocheck '%s' agora falha para %s em %s

source: annocheck '%s' test fails for %s on %s
pt_br: O teste annocheck '%s' falha para %s em %s

source: %s may have lost -D_FORTIFY_SOURCE on %s
pt_br: %s pode ter perdido -D_FORTIFY_SOURCE em %s

source: lost ${ARCH}
pt_br: perdeu ${ARCH}

source: Architecture '%s' has disappeared
pt_br: A arquitetura '%s' desapareceu

source: gained ${ARCH}
pt_br: ganhou ${ARCH}

source: Architecture '%s' has appeared
pt_br: A arquitetura '%s' apareceu

source: Forbidden function symbols found:
pt_br: Símbolos de função proibidos encontrados:

source: %s may use forbidden functions on %s
pt_br: %s pode usar funções proibidas em %s

source: forbidden functions in ${FILE} on ${ARCH}
pt_br: funções proibidas em ${FILE} em ${ARCH}

source: File capabilities for %s changed from '%s' to '%s' in %s on %s
pt_br: Capacidades de arquivo para %s alteradas de '%s' para '%s' em %s em %s

source: ${FILE} capabilities on ${ARCH}
pt_br: Capacidades de ${FILE} em ${ARCH}

source: File capabilities found for %s: '%s' in %s on %s
pt_br: Capacidades de arquivo encontrados para %s: '%s' em %s em %s

source: File capabilities list entry found for %s: '%s' in %s on %s, matches package
pt_br: Entrada da lista de recursos de arquivo encontrada para %s: '%s' em %s em %s, corresponde ao pacote

source: File capabilities list mismatch for %s: expected '%s', got '%s' in %s on %s
pt_br: Lista de capacidades de arquivo incompatível para %s: '%s' esperado, obtido '%s' em %s em %s

source: ${FILE} capabilities list on ${ARCH}
pt_br: Lista de capacidades ${FILE} em ${ARCH}

source: File capabilities for %s (%s) not found on the capabilities list in %s on %s
pt_br: Capacidades de arquivo para %s (%s) não encontradas na lista de capacidades em %s em %s

source: File capabilities expected for %s in %s but not found on %s: expected '%s'
pt_br: Capacidades de arquivo esperados para %s em %s, mas não encontrados em %s: esperado '%s'

source: Changes to security policy related files require inspection by the Security Response Team.
pt_br: As alterações nos arquivos relacionados à política de segurança exigem inspeção pela Equipe de Resposta de Segurança.

source: Compressed %s file %s changed content in %s on %s.
pt_br: O arquivo %s compactado %s alterou o conteúdo em %s em %s.

source: Error running msgunfmt on %s in %s on %s; malformed mo file?
pt_br: Erro ao executar msgunfmt em %s em %s em %s; arquivo mo malformado?

source: msgunfmt on ${FILE}
pt_br: msgunfmt em ${FILE}

source: Message catalog %s changed content in %s on %s
pt_br: O catálogo de mensagens %s alterou o conteúdo em %s em %s

source: Public header file %s changed content in %s on %s. A unified diff of the changes follows.
pt_br: O arquivo de cabeçalho público %s alterou o conteúdo em %s em %s. Segue uma comparação unificada das mudanças.

source: File %s changed content in %s on %s.
pt_br: O arquivo %s alterou o conteúdo em %s em %s.

source: Inspection skipped because this build's type is not `rpm'.
pt_br: A inspeção foi ignorada porque o tipo desta compilação não é `rpm'.

source: %%config file %s went from actual file to symlink (pointing to %s) in %s on %s
pt_br: O arquivo %%config %s passou do arquivo real para o link simbólico (apontando para %s) em %s em %s

source: %%config file %s was a symlink (pointing to %s), became an actual file in %s on %s
pt_br: O arquivo %%config %s era um link simbólico (apontando para %s), tornou-se um arquivo real em %s em %s

source: Symlink value for %%config file %s changed in %s on %s.
pt_br: Valor do link simbólico para o arquivo %%config %s alterado em %s em %s.

source: %%config file content change for %s in %s on %s
pt_br: Alteração no conteúdo do arquivo %%config para %s em %s em %s

source: %%config file change for %s in %s on %s (%smarked as %%config -> %smarked as %%config)
pt_br: Alteração do arquivo %%config para %s em %s em %s (%smarcado como %%config -> %smarcado como %%config)

source: not
pt_br: não

source: %s in %s on %s is missing debugging symbols
pt_br: %s em %s em %s faltam símbolos de depuração

source: missing debugging symbols
pt_br: faltando símbolos de depuração

source: Missing: %s
pt_br: Faltando: %s

source: %s in %s on %s contains debugging symbols
pt_br: %s em %s em %s contém símbolos de depuração

source: contains debugging symbols
pt_br: contém símbolos de depuração

source: Contains: %s
pt_br: Contém: %s

source: %s in %s on %s gained debugging symbols
pt_br: %s em %s em %s ganhou símbolos de depuração

source: gained debugging symbols
pt_br: ganhou símbolos de depuração

source: Gained: %s
pt_br: Ganhou: %s

source: %s in %s on %s lost debugging symbols
pt_br: %s em %s em %s perdeu símbolos de depuração

source: lost debugging symbols
pt_br: perdeu símbolos de depuração

source: Lost: %s
pt_br: Perdeu: %s

source: %s in %s on %s carries .gosymtab but should not have the .gnu_debugdata symbol
pt_br: %s em %s em %s carrega .gosymtab, mas não deveria ter o símbolo .gnu_debugdata

source: .gnu_debugdata with .gosymtab
pt_br: .gnu_debugdata com .gosymtab

source: Desktop file %s on %s references executable %s but %s is not executable by all
pt_br: O arquivo desktop %s em %s faz referência ao executável %s, mas %s não é executável por todos

source: ${FILE} references non-executable file on ${ARCH}
pt_br: ${FILE} faz referência a arquivo não executável em ${ARCH}

source: Desktop file %s on %s references executable %s; no subpackages contain an executable of that name, however it has a TryExec key so it may be ignored in case %s does not exist
pt_br: O arquivo desktop %s em %s faz referência ao executável %s; nenhum subpacote contém um executável com esse nome, porém ele possui uma chave TryExec, portanto pode ser ignorado caso %s não exista

source: Desktop file %s on %s references executable %s but no subpackages contain an executable of that name
pt_br: O arquivo desktop %s em %s faz referência ao executável %s, mas nenhum subpacote contém um executável com esse nome

source: ${FILE} references missing executable on ${ARCH}
pt_br: ${FILE} faz referência ao executável ausente em ${ARCH}

source: Desktop file %s on %s references icon %s but %s is not readable by all
pt_br: O arquivo desktop %s em %s faz referência ao ícone %s, mas %s não pode ser lido por todos

source: ${FILE} references unreadble icon on ${ARCH}
pt_br: ${FILE} faz referência a ícone ilegível em ${ARCH}

source: Desktop file %s on %s references icon %s but no subpackages contain %s
pt_br: O arquivo desktop %s em %s faz referência ao ícone %s, mas nenhum subpacote contém %s

source: ${FILE} references missing icon on ${ARCH}
pt_br: ${FILE} faz referência a um ícone ausente em ${ARCH}

source: ${FILE} is not valid on ${ARCH}
pt_br: ${FILE} não é válido em ${ARCH}

source: File %s is no longer a valid desktop entry file on %s; desktop-file-validate reports:
pt_br: O arquivo %s não é mais um arquivo válido de entradas desktop em %s; desktop-file-validate relata:

source: New file %s is not a valid desktop file on %s; desktop-file-validate reports:
pt_br: O novo arquivo %s não é um arquivo desktop válido em %s; desktop-file-validate relata:

source: File %s is not a valid desktop file on %s; desktop-file-validate reports:
pt_br: O arquivo %s não é um arquivo desktop válido em %s; desktop-file-validate relata:

source: The %s file is missing the %s tag.
pt_br: O arquivo %s não possui a tag %s.

source: ${FILE} missing Release tag
pt_br: ${FILE} carece da tag Release

source: The %s tag value is missing the dist tag in the proper form. The dist tag should be of the form '%s' in the %s tag or in a macro used in the %s tag. After RPM macro expansion, no dist tag was found in this %s tag value.
pt_br: O valor da tag %s não contém a tag dist no formato adequado. A tag dist deve estar no formato '%s' na tag %s ou em uma macro usada na tag %s. Após a expansão da macro RPM, nenhuma tag dist foi encontrada neste valor de tag %s.

source: ${FILE} does not use '%%{?dist}' in Release
pt_br: ${FILE} não usa '%%{?dist}' em Release

source: Specified package is not a source RPM, skipping.
pt_br: O pacote especificado não é um RPM fonte, ignorando.

source: %%doc file content change for %s in %s on %s
pt_br: Alteração no conteúdo do arquivo %%doc para %s em %s em %s

source: %%doc file change for %s in %s on %s (%smarked as %%doc -> %smarked as %%doc)
pt_br: Alteração do arquivo %%doc para %s em %s em %s (%smarcado como %%doc -> %smarcado como %%doc)

source: %s was an ELF file and now is not on %s
pt_br: %s era um arquivo ELF e agora não está em %s

source: ELF file ${FILE} on ${ARCH}
pt_br: Arquivo ELF ${FILE} em ${ARCH}

source: %s was a dynamic ELF file and now is not on %s
pt_br: %s era um arquivo ELF dinâmico e agora não está em %s

source: DT_NEEDED symbol(s) removed from %s on %s
pt_br: Símbolo(s) DT_NEEDED removido(s) de %s em %s

source: DT_NEEDED symbol(s) in ${FILE} on ${ARCH}
pt_br: Símbolo(s) DT_NEEDED em ${FILE} em ${ARCH}

source: DT_NEEDED symbol(s) added to %s on %s
pt_br: Símbolo(s) DT_NEEDED adicionados a %s em %s

source: Object still has executable stack (no GNU-stack note): %s on %s
pt_br: O objeto ainda possui pilha executável (sem nota sobre pilha GNU): %s em %s

source: Object has executable stack (no GNU-stack note): %s on %s
pt_br: O objeto possui pilha executável (sem nota sobre pilha GNU): %s em %s

source: Program built without GNU_STACK: %s on %s
pt_br: Programa compilado sem GNU_STACK: %s em %s

source: GNU_STACK in ${FILE} on ${ARCH}
pt_br: GNU_STACK em ${FILE} em ${ARCH}

source: File %s has invalid execstack flags (%s) on %s
pt_br: O arquivo %s possui sinalizadores execstack inválidos (%s) em %s

source: File %s has unrecognized GNU_STACK '%s' (expected RW or RWE) on %s
pt_br: O arquivo %s possui GNU_STACK '%s' (RW ou RWE esperado) não reconhecido em %s

source: execstack in ${FILE} on ${ARCH}
pt_br: execstack em ${FILE} em ${ARCH}

source: Object still has executable stack (GNU-stack note = X): %s on %s
pt_br: O objeto ainda possui pilha executável (nota da pilha GNU = X): %s em %s

source: Object has executable stack (GNU-stack note = X): %s on %s
pt_br: O objeto possui uma pilha executável (nota da pilha GNU = X): %s em %s

source: Stack is still executable: %s on %s
pt_br: A pilha ainda é executável: %s em %s

source: Stack is executable: %s on %s
pt_br: A pilha é executável: %s em %s

source: %s lost full GNU_RELRO security protection on %s
pt_br: %s perdeu proteção de segurança completa do GNU_RELRO em %s

source: %s lost GNU_RELRO security protection on %s
pt_br: %s perdeu a proteção de segurança GNU_RELRO em %s

source: lost GNU_RELRO in ${FILE} on ${ARCH}
pt_br: perdeu GNU_RELRO em ${FILE} em ${ARCH}

source: The following objects lost -fPIC:
pt_br: Os seguintes objetos perderam -fPIC:

source: The following new objects were built without -fPIC:
pt_br: Os seguintes novos objetos foram compilados sem -fPIC:

source: %s in %s has objects built without -fPIC on %s
pt_br: %s em %s possui objetos compilados sem -fPIC em %s

source: missing -fPIC in ${FILE} on ${ARCH}
pt_br: faltando -fPIC em ${FILE} em ${ARCH}

source: TEXTREL relocations in ${FILE} on ${ARCH}
pt_br: Realocações de TEXTREL em ${FILE} em ${ARCH}

source: %s in %s acquired TEXTREL relocations on %s
pt_br: %s em %s adquiriu realocações TEXTREL em %s

source: %s in %s has TEXTREL relocations on %s
pt_br: %s em %s tem realocações TEXTREL em %s

source: New package %s is empty (no payloads); this is expected per the rpminspect configuration
pt_br: O novo pacote %s está vazio (sem cargas úteis); isso é esperado pela configuração do rpminspect

source: New package %s is empty (no payloads); this is expected because the package only contains %%ghost entries
pt_br: O novo pacote %s está vazio (sem cargas úteis); isto é esperado porque o pacote contém apenas entradas %%ghost

source: New package %s is empty (no payloads)
pt_br: O novo pacote %s está vazio (sem cargas úteis)

source: ${FILE} has empty payload
pt_br: ${FILE} tem carga útil vazia

source: Forbidden path reference (%s) on line %ld of %s
pt_br: Referência de caminho proibido (%s) na linha %ld de %s

source: invalid spec line: %s
pt_br: linha do spec inválida: %s

source: The files inspection is only for source packages, skipping.
pt_br: A inspeção de arquivos é apenas para pacotes fonte, ignorando.

source: %s became a non-empty file on %s
pt_br: %s tornou-se um arquivo não vazio em %s

source: non-empty ${FILE} on ${ARCH}
pt_br: ${FILE} não vazio em ${ARCH}

source: %s became an empty file on %s
pt_br: %s tornou-se um arquivo vazio em %s

source: empty ${FILE} on ${ARCH}
pt_br: vazio ${FILE} em ${ARCH}

source: %s grew by %lld%% on %s
pt_br: %s cresceu %lld%% em %s

source: ${FILE} size grew on ${ARCH}
pt_br: O tamanho de ${FILE} aumentou em ${ARCH}

source: %s shrank by %lld%% on %s
pt_br: %s encolheu em %lld%% em %s

source: ${FILE} size shrank on ${ARCH}
pt_br: O tamanho de ${FILE} diminuiu em ${ARCH}

source: File %s (%s), Java byte code version %d is incorrect (wrong endianness? corrupted file? space JDK?)
pt_br: Arquivo %s (%s), versão do código de byte Java %d está incorreta (endianness errado? arquivo corrompido? espaço JDK?)

source: incorrect Java byte code version in ${FILE}
pt_br: versão incorreta do código de bytes Java em ${FILE}

source: File %s (%s), Java byte code version %d greater than supported major version %d for product release %s
pt_br: Arquivo %s (%s), versão do código de byte Java %d superior à versão principal suportada %d para o lançamento do produto %s

source: Java byte code version too new in ${FILE}
pt_br: Versão do código de bytes Java muito nova em ${FILE}

source: Java byte code version changed from %d to %d in %s from %s
pt_br: Versão do código de byte Java alterada de %d para %d em %s de %s

source: Java byte code version changed in ${FILE}
pt_br: Versão do código de bytes Java alterada em ${FILE}

source: *** missing JVM version to product release mapping
pt_br: *** faltando versão JVM para mapeamento de lançamento do produto

source: Comparing %s to %s in package %s on %s generated a kmidiff(1) usage error.
pt_br: Comparar %s com %s no pacote %s em %s gerou um erro de uso do kmidiff(1).

source: kmidiff usage error
pt_br: erro de uso do kmidiff

source: Comparing %s to %s in package %s on %s revealed Kernel Module Interface (KMI) differences.
pt_br: A comparação de %s com %s no pacote %s em %s revelou diferenças na Kernel Module Interface (KMI).

source: KMI change in ${FILE} on ${ARCH}
pt_br: Alteração de KMI em ${FILE} em ${ARCH}

source: Comparing %s to %s in package %s on %s revealed incompatible Kernel Module Interface (KMI) differences.
pt_br: A comparação de %s com %s no pacote %s em %s revelou diferenças incompatíveis na Kernel Module Interface (KMI).

source: KMI incompatible change in ${FILE} on ${ARCH}
pt_br: Alteração incompatível com KMI em ${FILE} em ${ARCH}

source: kmidiff(1) comparison of %s to %s in package %s on %s ended unexpectedly.
pt_br: A comparação kmidiff(1) de %s com %s no pacote %s em %s terminou inesperadamente.

source: kmidiff unexpected exit
pt_br: saída inesperada do kmidiff

source: Command: %s Exit code: %d%s%s
pt_br: Comando: %s Código de saída: %d%s%s

source: ${FILE} kernel module alias on ${ARCH}
pt_br: Alias do módulo do kernel ${FILE} em ${ARCH}

source: Kernel module '%s' lost alias '%s'
pt_br: O módulo do kernel '%s' perdeu o alias '%s'

source: Kernel module '%s' gained alias '%s'
pt_br: O módulo do kernel '%s' ganhou o alias '%s'

source: Kernel module %s removes parameter '%s' (was present in %s).
pt_br: O módulo do kernel %s remove o parâmetro '%s' (estava presente em %s).

source: ${FILE} kernel module parameter on ${ARCH}
pt_br: Parâmetro do módulo do kernel ${FILE} em ${ARCH}

source: Kernel module %s adds parameter '%s' (was not present in %s).
pt_br: O módulo do kernel %s adiciona o parâmetro '%s' (não estava presente em %s).

source: Kernel module %s removes dependency '%s' (was present in %s).
pt_br: O módulo do kernel %s remove a dependência '%s' (estava presente em %s).

source: ${FILE} kernel module dependency on ${ARCH}
pt_br: Dependência do módulo do kernel ${FILE} em ${ARCH}

source: Kernel module %s adds dependency '%s' (was not present in %s).
pt_br: O módulo do kernel %s adiciona dependência '%s' (não estava presente em %s).

source: ${FILE} kernel module parameter
pt_br: Parâmetro de módulo do kernel ${FILE}

source: *** parse error in license database %s
pt_br: *** erro de análise no banco de dados de licenças %s

source: *** problem checking license database
pt_br: *** problema ao verificar banco de dados de licenças

source: Unapproved license in %s: %s
pt_br: Licença não aprovada em %s: %s

source: Empty License Tag in %s
pt_br: Tag License vazia em %s

source: missing License tag in ${FILE}
pt_br: faltando tag License em ${FILE}

source: Valid License Tag in %s: %s
pt_br: Tag License válida em %s: %s

source: License Tag contains unprofessional language in %s: %s
pt_br: A tag License contém linguagem não profissional em %s: %s

source: unprofessional language in License tag in ${FILE}
pt_br: linguagem não profissional na tag License em ${FILE}

source: Missing license database(s).
pt_br: Faltando banco(s) de dados de licença.

source: missing license database
pt_br: faltando banco de dados de licença

source: Existing subpackage %s is now missing on %s
pt_br: O subpacote %s existente agora está faltando em %s

source: missing subpackage ${FILE} on ${ARCH}
pt_br: faltando subpacote ${FILE} em ${ARCH}

source: Package %s on %s continues to be empty (no payloads)
pt_br: O pacote %s em %s continua vazio (sem cargas úteis)

source: existing empty subpackage ${FILE} on ${ARCH}
pt_br: subpacote vazio existente ${FILE} em ${ARCH}

source: Package %s on %s became empty (no payloads)
pt_br: O pacote %s em %s ficou vazio (sem cargas úteis)

source: subpackage ${FILE} on ${ARCH} now has empty payload
pt_br: o subpacote ${FILE} em ${ARCH} agora tem carga útil vazia

source: ${FILE} not portable on ${ARCH}
pt_br: ${FILE} não é portátil em ${ARCH}

source: %s contains symbols [%s] on %s; this is not portable across compiler versions
pt_br: %s contém símbolos [%s] em %s; isso não é portátil entre versões do compilador

source: %s contains symbol [%s] on %s; this is not portable across compiler versions
pt_br: %s contém o símbolo [%s] em %s; isso não é portátil entre versões do compilador

source: Error parsing %s:%d:%d: %s: %s: %s
pt_br: Erro ao analisar %s:%d:%d: %s: %s: %s

source: *** unable to compile man page path regular expression: %s
pt_br: *** não foi possível compilar a expressão regular do caminho da página man: %s

source: Unable to open man page %s
pt_br: Não foi possível abrir a página man %s

source: Man page %s does not end in %s
pt_br: A página man %s não termina em %s

source: man page with %s suffix is not really compressed with gzip
pt_br: A página man com sufixo %s não está realmente compactada com gzip

source: Errors found validating %s
pt_br: Erros encontrados na validação de %s

source: Man page %s is possibly empty on %s in %s
pt_br: A página man %s está possivelmente vazia em %s em %s

source: empty man page ${FILE} on ${ARCH}
pt_br: página man vazia ${FILE} em ${ARCH}

source: Man page checker reported problems with %s on %s in %s
pt_br: O verificador de páginas man relatou problemas com %s em %s em %s

source: man page ${FILE} on ${ARCH} has errors
pt_br: A página man ${FILE} em ${ARCH} contém erros

source: Man page %s has incorrect path on %s in %s
pt_br: A página man %s tem caminho incorreto em %s em %s

source: man page ${FILE} on ${ARCH} has incorrect path
pt_br: A página man ${FILE} em ${ARCH} tem um caminho incorreto

source: Vendor not set in the rpminspect configuration, ignoring Package Vendor "%s" in %s
pt_br: Fornecedor não definido na configuração do rpminspect, ignorando o fornecedor do pacote "%s" em %s

source: Package Vendor "%s" is not "%s" in %s
pt_br: Fornecedor do pacote "%s" não é "%s" em %s

source: invalid vendor ${FILE} on ${ARCH}
pt_br: fornecedor inválido ${FILE} em ${ARCH}
