Repository: rffontenelle/rpminspect-l10n
Catalog: *.po
Languages: pt_br

source: Make sure symlinks point to a valid destination in one of the subpackages of the build; dangling symlinks are not allowed. If you are comparing builds and have a non-symlink turn in to a symlink, ensure this is deliberate. NOTE: You cannot turn a directory in to a symlink due to RPM limitations. If you absolutely must do that, make sure you include the %pretrans scriptlet for replacing a directory. See the packaging guidelines for 'Scriptlet to replace a directory' for more information.
pt_br: Certifique-se de que os links simbólicos apontem para um destino válido em um dos subpacotes da compilação; links simbólicos pendentes (dandling) não são permitidos. Se você estiver comparando compilações e um link não simbólico se transformar em um link simbólico, certifique-se de que isso seja deliberado. NOTA: Você não pode transformar um diretório em um link simbólico devido às limitações do RPM. Se for absolutamente necessário fazer isso, certifique-se de incluir o scriptlet %pretrans para substituir um diretório. Consulte as diretrizes de empacotamento para 'Scriptlet para substituir um diretório' para obter mais informações.

source: Remove forbidden path references from the indicated line in the %files section. In many cases you can use RPM macros to specify path locations. See the RPM documentation or distribution package maintainer guide for more information.
pt_br: Remova referências de caminhos proibidos da linha indicada na seção %files. Em muitos casos, você pode usar macros RPM para especificar locais de caminho. Consulte a documentação do RPM ou o guia do mantenedor do pacote de distribuição para obter mais informações.

source: In many cases the changing MIME type is deliberate. Verify that the change is intended and if necessary fix the spec file so the correct file is included in the built package.
pt_br: Em muitos casos, a alteração do tipo MIME é deliberada. Verifique se a alteração é intencional e, se necessário, corrija o arquivo spec para que o arquivo correto seja incluído no pacote compilado.

source: ABI changes introduced during maintenance updates can lead to problems for users. See the abidiff(1) documentation and the distribution ABI policies to determine if this detected change is allowed.
pt_br: As alterações da ABI introduzidas durante as atualizações de manutenção podem causar problemas para os usuários. Consulte a documentação do abidiff(1) e as políticas de distribuição da ABI para determinar se esta alteração detectada é permitida.

source: Kernel Module Interface introduced during maintenance updates can lead to problems for users. See the libabigail documentation and the distribution KMI policy to determine if this detected change is allowed.
pt_br: A interface do módulo kernel introduzida durante as atualizações de manutenção pode causar problemas para os usuários. Consulte a documentação do libabigail e a política KMI de distribuição para determinar se esta alteração detectada é permitida.

source: Changes to %config should be done carefully. Make sure you have installed the correct file and in the correct location. If a package is restructuring configuration files, make sure the package can handle upgrading an existing package -or- honor the old file locations.
pt_br: As alterações em %config devem ser feitas com cuidado. Certifique-se de ter instalado o arquivo correto e no local correto. Se um pacote estiver reestruturando arquivos de configuração, certifique-se de que o pacote possa lidar com a atualização de um pacote existente -ou- respeite os locais de arquivo antigos.

source: Changes found among the %doc files. Verify these changes are intended if the package is not a rebase. Sometimes upstream projects rename or move documentation files and the spec file needs to account for those changes.
pt_br: Alterações encontradas entre os arquivos %doc. Verifique se essas alterações são intencionais se o pacote não for um rebase. Às vezes, os projetos upstream renomeiam ou movem arquivos de documentação e o arquivo spec precisa levar em conta essas alterações.

source: An invalid patch file was found. This is usually the result of generating a collection of patches by comparing two trees. When files disappear that can lead to zero length patches in the resulting collection. Check to see if the source package has any zero length or otherwise invalid patches and correct the problem.
pt_br: Um arquivo de patch inválido foi encontrado. Geralmente, isso é o resultado da geração de uma coleção de patches comparando duas árvores. Quando os arquivos desaparecem, isso pode levar a patches de comprimento zero na coleção resultante. Verifique se o pacote fonte tem comprimento zero ou patches inválidos e corrija o problema.

source: The named patch is defined in the source RPM header (this means it has a PatchN: definition in the spec file) but is not applied anywhere in the spec file. It is missing a corresponding %patch macro and the spec file lacks the %autosetup or %autopatch macros. You can fix this by adding the appropriate %patch macro in the spec file (usually in the %prep section). The number specified with the %patch macro corresponds to the number used to define the patch at the top of the spec file. So Patch47 is applied with either a '%patch 47', '%patch -P 47', '%patch -P47', or '%patch47' macro.
pt_br: O patch nomeado está definido no cabeçalho do RPM fonte (isso significa que possui uma definição PatchN: no arquivo spec), mas não é aplicado em nenhum lugar do arquivo spec. Está faltando uma macro %patch correspondente e o arquivo spec não possui as macros %autosetup ou %autopatch. Você pode corrigir isso adicionando a macro %patch apropriada no arquivo spec (geralmente na seção %prep). O número especificado com a macro %patch corresponde ao número usado para definir o patch no topo do arquivo spec. Portanto, Patch47 é aplicado com uma macro '%patch 47', '%patch -P 47', '%patch -P47' ou '%patch47'.

source: The named patch is defined but is mismatched by number with the %patch macro. Make sure all numbered patches have corresponding %patch macros. For example, Patch47 needs to have either a '%patch 47', '%patch -P 47', '%patch -P47', or '%patch47' macro.
pt_br: O patch nomeado está definido, mas não corresponde por número à macro %patch. Certifique-se de que todos os patches numerados tenham macros %patch correspondentes. Por exemplo, Patch47 precisa ter uma macro '%patch 47', '%patch -P 47', '%patch -P47' ou '%patch47'.

source: The defined patch file is not something rpminspect can handle. This is likely a bug and should be reported to the upstream rpminspect project.
pt_br: O arquivo de patch definido não é algo que o rpminspect possa manipular. Provavelmente é um bug e deve ser relatado ao projeto upstream do rpminspect.

source: ClamAV has found a virus in the named file. This may be a false positive, but you should manually inspect the file in question to ensure it is clean. This may be a problem with the ClamAV database or detection. If you are sure the file in question is clean, please file a bug with rpminspect for further help.
pt_br: ClamAV encontrou um vírus no arquivo nomeado. Isso pode ser um falso positivo, mas você deve inspecionar manualmente o arquivo em questão para garantir que esteja limpo. Isso pode ser um problema com o banco de dados ou detecção do ClamAV. Se você tiver certeza de que o arquivo em questão está limpo, registre um bug no rpminspect para obter mais ajuda.

source: A file with potential politically sensitive content was found in the package. If this file is permitted, it should be added to the rpminspect vendor data package for the product. Modify the %s file and send a patch to the project that owns it.
pt_br: Um arquivo com potencial conteúdo politicamente sensível foi encontrado no pacote. Se esse arquivo for permitido, ele deverá ser adicionado ao pacote de dados do fornecedor rpminspect do produto. Modifique o arquivo %s e envie um patch para o projeto que contém isso.

source: Forbidden symbols were found in an ELF file in the package. The configuration settings for rpminspect indicate the named symbols are forbidden in packages. If this is deliberate, you may want to disable the badfuncs inspection. If it is not deliberate, check the man pages for the named symbols to see what API functions have replaced the forbidden symbols. Usually a function is marked as deprecated but still provided in order to allow for backwards compatibility. Whenever possible the deprecated functions should not be used.
pt_br: Símbolos proibidos foram encontrados em um arquivo ELF no pacote. As definições de configuração do rpminspect indicam que os símbolos nomeados são proibidos em pacotes. Se isso for deliberado, você pode desabilitar a inspeção de badfuncs. Se não for deliberado, verifique as páginas de manual dos símbolos nomeados para ver quais funções da API substituíram os símbolos proibidos. Normalmente, uma função é marcada como descontinuada, mas ainda fornecida para permitir compatibilidade com versões anteriores. Sempre que possível, as funções obsoletas não devem ser usadas.

source: Either DT_RPATH or DT_RUNPATH properties were found on ELF shared objects in this package. The use of DT_RPATH and DT_RUNPATH is discouraged except in certain situations. Check to see that you a disabling rpath during the %build stage of the spec file. If you are unable to do this easily, you can try using a program such as patchelf to remove these properties from the ELF files.
pt_br: As propriedades DT_RPATH ou DT_RUNPATH foram encontradas em objetos compartilhados ELF neste pacote. O uso de DT_RPATH e DT_RUNPATH é desencorajado, exceto em determinadas situações. Verifique se você desativou o rpath durante o estágio %build do arquivo spec. Se não conseguir fazer isso facilmente, você pode tentar usar um programa como o patchelf para remover essas propriedades dos arquivos ELF.

source: Both DT_RPATH and DT_RUNPATH properties were found in an ELF shared object. This indicates a linker error and should not happen. ELF objects should only carry DT_RPATH or DT_RUNPATH, never both.
pt_br: As propriedades DT_RPATH e DT_RUNPATH foram encontradas em um objeto compartilhado ELF. Isso indica um erro do vinculador e não deveria acontecer. Objetos ELF devem carregar apenas DT_RPATH ou DT_RUNPATH, nunca ambos.

source: The rpminspect configuration file contains a list of forbidden Unicode code points. One was found in the extracted and patched source tree or in one of the text source files in the source RPM. Either remove this code point or discuss the situation with the Product Security Team to determine the correct course of action.
pt_br: O arquivo de configuração rpminspect contém uma lista de pontos de código Unicode proibidos. Um foi encontrado na árvore de fontes extraída e corrigida ou em um dos arquivos de texto fonte no RPM de origem. Remova esse ponto de código ou discuta a situação com a equipe de segurança do produto para determinar o curso de ação correto.

source: The %prep section of the spec file could not be executed for some reason. This usually results from a failure in librpmbuild, which is usually tied to archive extraction problems or the filesystem changing while rpminspect is running. A common cause is removal of the working directory while the program is executing.
pt_br: A seção %prep do arquivo spec não pôde ser executada por algum motivo. Isso geralmente resulta de uma falha no librpmbuild, que geralmente está ligada a problemas de extração de arquivos ou à alteração do sistema de arquivos enquanto o rpminspect está em execução. Uma causa comum é a remoção do diretório de trabalho enquanto o programa está em execução.

source: Unexpanded RPM spec file macros were found in the noted dependency rule. Check the spec file for this dependency and ensure you have not misspelled a macro or used a macro name that does not exist.
pt_br: Macros de arquivo spec RPM não expandidas foram encontradas na regra de dependência observada. Verifique o arquivo spec dessa dependência e certifique-se de não ter digitado uma macro incorretamente ou usado um nome de macro que não existe.

source: Add the indicated explicit Requires to the spec file for the named subpackage. Subpackages depending on shared libraries in another subpackage must carry an explicit 'Requires: SUBPACKAGE_NAME = %{version}-%{release}' in the spec file.
pt_br: Adicione o Requires explícito indicado ao arquivo spec do subpacote nomeado. Subpacotes que dependem de bibliotecas compartilhadas em outro subpacote devem conter um 'Requires: NOME_SUBPACOTE = %{version}-%{release}' explícito no arquivo spec.

source: Add the indicated explicit Requires to the spec file for the named subpackage. Subpackages depending on shared libraries in another subpackage must carry an explicit 'Requires: SUBPACKAGE_NAME = %{epoch}:%{version}-%{release}' in the spec file.
pt_br: Adicione o Requires explícito indicado ao arquivo spec do subpacote nomeado. Os subpacotes que dependem de bibliotecas compartilhadas em outro subpacote devem conter um explícito 'Requires: NOME_SUBPACOTE = %{epoch}:%{version}-%{release}' no arquivo spec.

source: Check subpackage %files sections and explicit Provides statements. Only one subpackage should provide a given shared library. Shared library names are automatically added as Provides, so there is no need to specify them in the spec file but you do need to make sure only one subpackage is packaging up the shared library in question.
pt_br: Verifique as seções %files do subpacote e as instruções Provides explícitas. Apenas um subpacote deve fornecer uma determinada biblioteca compartilhada. Os nomes das bibliotecas compartilhadas são adicionados automaticamente como Provides, portanto não há necessidade de especificá-los no arquivo spec, mas você precisa ter certeza de que apenas um subpacote está empacotando a biblioteca compartilhada em questão.

source: A dependency listed in the before build changed to the indicated dependency in the after build. If this is a VERIFY result, it means rpminspect noticed the change in what it considers a maintenance update in a package. An INFO result means it noticed this change, but deems it ok because it is comparing a rebased build.
pt_br: Uma dependência listada na compilação anterior foi alterada para a dependência indicada na compilação posterior. Se este for um resultado VERIFY, significa que o rpminspect notou a mudança no que considera uma atualização de manutenção em um pacote. Um resultado INFO significa que ele percebeu essa mudança, mas considera que está tudo bem porque está comparando uma compilação rebaseada.

source: A new dependency is seen in the after build that was not present in the before build. If this is a VERIFY result, it means rpminspect noticed the change in what it considers a maintenance update in a package. An INFO result means it noticed this change, but deems it ok because it is comparing a rebased build.
pt_br: Uma nova dependência é vista na compilação posterior que não estava presente na compilação anterior. Se este for um resultado VERIFY, significa que o rpminspect notou a mudança no que considera uma atualização de manutenção em um pacote. Um resultado INFO significa que ele percebeu essa mudança, mas considera que está tudo bem porque está comparando uma compilação rebaseada.

source: A dependency seen in the before build is not seen in the after build meaning it was removed or lost. If this is a VERIFY result, it means rpminspect noticed the change in what it considers a maintenance update in a package. An INFO result means it noticed this change, but deems it ok because it is comparing a rebased build.
pt_br: Uma dependência vista na compilação anterior não é vista na compilação posterior, o que significa que foi removida ou perdida. Se este for um resultado VERIFY, significa que o rpminspect notou a mudança no que considera uma atualização de manutenção em um pacote. Um resultado INFO significa que ele percebeu essa mudança, mas considera que está tudo bem porque está comparando uma compilação rebaseada.

source: The package has an Epoch value greater than zero, but the explicit subpackage dependencies are not consistently using it. For the dependency reported, the '= %{version}-%{release}' needs to change to '= %{epoch}:%{version}-%{release}' to capture the package package Epoch in the dependency.
pt_br: O pacote tem um valor de Epoch maior que zero, mas as dependências explícitas do subpacote não o utilizam de forma consistente. Para a dependência relatada, '= %{version}-%{release}' precisa mudar para '= %{epoch}:%{version}-%{release}' para capturar o pacote Epoch na dependência.

source: Refer to the udev documentation at https://www.freedesktop.org/software/systemd/man/udev.html for help correcting the errors and warnings.
pt_br: Consulte a documentação do udev em https://www.freedesktop.org/software/systemd/man/udev.html para obter ajuda na correção de erros e avisos.

source: *** malformed ABI level identifier: %s
pt_br: *** identificador de nível ABI malformado: %s

source: *** ABI level %d already defined
pt_br: *** nível ABI %d já definido

source: *** malformed ABI level entry: %s
pt_br: *** entrada de nível ABI malformada: %s

source: *** unable to create download directory %s
pt_br: *** não foi possível criar o diretório de download %s

source: *** unknown working directory type: %d
pt_br: *** tipo de diretório de trabalho desconhecido: %d

source: *** unable to read %s, skipping
pt_br: *** não foi possível ler %s, ignorando

source: *** unknown directory member encountered: %s
pt_br: *** membro de diretório desconhecido encontrado: %s

source: There is not enough available space to download the requested %s.
pt_br: Não há espaço disponível o suficiente para fazer o download do %s requisitado.

source: Need %s in %s, have %s.
pt_br: Preciso de %s em %s, tenho %s.

source: See the `-w' option for specifying an alternate working directory.
pt_br: Veja a opção `-w' para especificar um diretório de trabalho alternativo.

source: Unable to determine the required space to download the requested %s.
pt_br: Não foi possível determinar o espaço necessário para fazer o download do %s requisitado.

source: Ensure %s has sufficient space available.
pt_br: Certifique-se de que %s tenha espaço suficiente disponível.

source: build
pt_br: compilação

source: Downloading module
pt_br: Baixando módulo

source: Downloading RPM build
pt_br: Baixando compilação de RPM

source: *** ignoring malformed module metadata file: %s
pt_br: *** ignorando arquivo de metadados de módulo malformado: %s

source: *** malformed rpm filters in file: %s
pt_br: *** filtros rpm malformados no arquivo: %s

source: task
pt_br: tarefa

source: *** `%s' already exists in %s
pt_br: *** `%s' já existe em %s

source: *** unable to find local build: %s
pt_br: *** não foi possível encontrar a compilação local: %s

source: *** unable to download RPM: %s
pt_br: *** não foi possível baixar o RPM: %s

source: *** unable to find build %s in Koji hub %s
pt_br: *** não foi possível encontrar a compilação %s no hub do Koji %s

source: *** unable to find task %s in Koji hub %s
pt_br: *** não foi possível encontrar a tarefa %s no hub do Koji %s

source: *** %s is a FIFO
pt_br: *** %s é um FIFO

source: %s already exists
pt_br: %s já existe

source: , overwriting
pt_br: , sobrescrevendo

source: *** unable to read %s
pt_br: *** não foi possível ler %s

source: %s in %s on %s carries expected mode %04o
pt_br: %s em %s em %s carrega o modo esperado %04o

source: %s in %s on %s carries unexpected mode %04o; expected mode %04o; requires inspection by the Security Team
pt_br: %s em %s em %s carrega o modo inesperado %04o; esperava-se o modo %04o; requer inspeção pela Equipe de Segurança

source: %s in %s on %s carries insecure mode %04o, Security Team review may be required
pt_br: %s em %s em %s carrega o modo inseguro %04o, uma revisão da Equipe de Segurança pode ser necessária

source: %s in %s on %s carries expected owner '%s'
pt_br: %s em %s em %s carrega o proprietário esperado '%s'

source: %s in %s on %s carries unexpected owner '%s'; expected owner '%s'; requires inspection by the Security Team
pt_br: %s em %s em %s carrega um proprietário inesperado '%s'; esperava-se o proprietário '%s'; requer inspeção pela Equipe de Segurança

source: %s in %s on %s carries insecure mode %04o but has no fileinfo rule for owner specification, Security Team review may be required
pt_br: %s em %s em %s carrega o modo inseguro %04o, mas não tem regra fileinfo para especificação do proprietário, pode ser necessária uma revisão da Equipe de Segurança

source: %s in %s on %s carries expected group '%s'
pt_br: %s em %s em %s carrega o grupo esperado '%s'

source: %s in %s on %s carries group unexpected '%s'; expected group '%s'; requires inspection by the Security Team
pt_br: %s em %s em %s carrega o grupo inesperado '%s'; esperava-se o grupo '%s'; requer inspeção pela Equipe de Segurança

source: *** invalid input string `%s`
pt_br: *** string de entrada inválida `%s`

source: *** invalid mode string: %s
pt_br: *** string de modo inválido: %s

source: *** problem adding entries to array %s->%s
pt_br: *** problema ao adicionar entradas ao array %s->%s

source: *** problem adding ignore entries to %s
pt_br: *** problema ao adicionar entradas ignoradas em %s

source: *** error reading
pt_br: *** erro ao ler

source: *** ignoring malformed section %s->%s
pt_br: *** ignorando seção malformada %s->%s

source: *** error reading %s ignore pattern
pt_br: *** erro ao ler o padrão a ser ignorado %s

source: *** flag must be 'on' or 'off'; ignoring '%s'
pt_br: *** o sinalizador deve ser 'on' ou 'off'; ignorando '%s'

source: *** unknown inspections: `%s`
pt_br: *** inspeções desconhecidas: `%s`

source: *** malformed/unknown inspections section
pt_br: *** seção de inspeções malformadas/desconhecidas

source: *** ignoring malformed %s configuration file: %s
pt_br: *** ignorando arquivo de configuração %s malformado: %s

source: *** unknown modularity static context settiongs '%s'
pt_br: *** configurações de contexto estático de modularidade desconhecida '%s'

source: *** unknown specname match setting '%s', defaulting to 'full'
pt_br: *** configuração de correspondência de nome de especificação desconhecido '%s', usando o padrão 'full'

source: *** unknown specname primary setting '%s', defaulting to 'name'
pt_br: *** configuração primária de nome de especificação desconhecido '%s', usando o padrão 'name'

source: *** invalid annocheck failure_reporting_level: %s, defaulting to %s
pt_br: *** failure_reporting_level inválido do annocheck: %s, usando o padrão %s

source: *** malformed badfuncs->allowed section
pt_br: *** seção badfuncs->allowed malformada

source: *** error reading unicode exclude regular expression: %s
pt_br: *** erro ao ler expressão regular de exclusão de unicode: %s

source: *** malformed rpmdeps->ignore section; skipping
pt_br: *** seção rpmdeps->ignore malformado; pulando

source: *** Invalid filename in the fileinfo list: %s
pt_br: *** Nome de arquivo inválido na lista fileinfo: %s

source: *** From this invalid line:
pt_br: *** Desta linha inválida:

source: *** unexpected token `%s' seen in %s, cannot continue
pt_br: *** token inesperado `%s' visto em %s, não é possível continuar

source: *** invalid security rule: %s
pt_br: *** regra de segurança inválida: %s

source: *** unknown security rule: %s
pt_br: *** regra de segurança desconhecida: %s

source: *** unknown security action: %s
pt_br: *** ação de segurança desconhecida: %s

source: *** malformed security line: %s
pt_br: *** linha de segurança malformada: %s

source: *** missing configuration file `%s'
pt_br: *** faltando arquivo de configuração `%s'

source: *** unable to find profile '%s'
pt_br: *** não foi possível encontrar o perfil '%s'
