Repository: rffontenelle/rpminspect-l10n
Catalog: *.po
Languages: pt_br

source: Verify the string specified in the License tag of the RPM metadata describes permissible software licenses as defined by the license database. Also checks to see if the License tag contains any unprofessional words as defined in the configuration file.
pt_br: Verifica se a string especificada na tag License dos metadados do RPM descreve as licenças de software permitidas conforme definido pelo banco de dados de licenças. Também verifica se a tag License contém palavras não profissionais, conforme definido no arquivo de configuração.

source: Check all binary RPMs in the build for any empty payloads. When comparing two builds, report new packages in the after build with empty payloads.
pt_br: Verifica todos os RPMs binários na compilação para ver se há cargas úteis (payloads) vazias. Ao comparar duas compilações, relate novos pacotes na compilação posterior com cargas úteis vazias.

source: Check all binary RPMs in the before and after builds for any empty payloads. Packages that lost payload data from the before build to the after build are reported.
pt_br: Verifica todos os RPMs binários nas compilações antes e depois para ver se há cargas úteis vazias. Os pacotes que perderam dados de carga útil da compilação anterior para a compilação posterior são relatados.

source: Perform some RPM header checks. First, check that the Vendor contains the expected string as defined in the configuration file. Second, check that the build host is in the expected subdomain as defined in the configuration file. Third, check the Summary string for any unprofessional words. Fourth, check the Description for any unprofessional words. Lastly, if there is a before build specified, check for differences between the before and after build values of the previous RPM header values and report them.
pt_br: Executa algumas verificações de cabeçalho RPM. Primeiro, verifica se o Vendor contém a string esperada conforme definido no arquivo de configuração. Segundo, verifica se o host de compilação está no subdomínio esperado conforme definido no arquivo de configuração. Terceiro, verifique a string de Summary em busca de palavras não profissionais. Quarto, verifica a Description em busca de palavras não profissionais. Por último, se houver uma compilação anterior especificada, verifique as diferenças entre os valores de compilação anterior e posterior dos valores de cabeçalho RPM anteriores e relate-as.

source: Perform some checks on man pages in the RPM payload. First, check that each man page is compressed. Second, check that each man page contains valid content. Lastly, check that each man page is installed to the correct path.
pt_br: Executa algumas verificações nas páginas man na carga útil do RPM. Primeiro, verifica se cada página man está compactada. Segundo, verifica se cada página man contém conteúdo válido. Por último, verifica se cada página man está instalada no caminho correto.

source: Check that XML files included in the RPM payload are well-formed.
pt_br: Verifica se os arquivos XML incluídos na carga útil RPM estão bem formados.

source: Perform several checks on ELF files. First, check that ELF objects do not contain an executable stack. Second, check that ELF objects do not contain text relocations. When comparing builds, check that the ELF objects in the after build did not lose a PT_GNU_RELRO segment. When comparing builds and there is a list of forbidden library functions, make sure nothing uses them.
pt_br: Executa várias verificações nos arquivos ELF. Primeiro, verifica se os objetos ELF não contêm uma pilha executável. Segundo, verifica se os objetos ELF não contêm realocações de texto. Ao comparar compilações, verifica se os objetos ELF na compilação posterior não perderam um segmento PT_GNU_RELRO. Ao comparar verifica e houver uma lista de funções de biblioteca proibidas, se certifica de que nada as utilize.

source: Perform syntax and file reference checks on *.desktop files. Syntax errors and invalid file references are reported as errors.
pt_br: Executa verificações de sintaxe e de referência de arquivo em arquivos *.desktop. Erros de sintaxe e referências de arquivo inválidas são relatados como erros.

source: Check that the 'Release' tag in the RPM spec file includes the %{?dist} directive.
pt_br: Verifica se a tag 'Release' no arquivo de especificação RPM inclui a diretiva %{?dist}.

source: Ensure the spec file name conforms to the NAME.spec naming format.
pt_br: Certifica-se de que o nome do arquivo spec esteja em conformidade com o formato de nomenclatura NOME.spec.

source: Ensure compliance with modularity build and packaging policies (only valid for module builds, no-op otherwise).
pt_br: Garante a conformidade com as políticas de compilação e empacotamento de modularidade (válido apenas para compilações de módulos, caso contrário, não operacional).

source: Check minimum required Java bytecode version in class files, report bytecode version changes between builds, and report if bytecode versions are exceeded. The bytecode version is vendor specific to releases and defined in the configuration file.
pt_br: Verifica a versão mínima necessária do bytecode Java nos arquivos de classe, relata alterações na versão do bytecode entre compilações e relate se as versões do bytecode foram excedidas. A versão do bytecode é específica do fornecedor para versões e definida no arquivo de configuração.

source: Report changed files from the before build to the after build. Certain file changes will raise additional warnings if the concern is more critical than just reporting changes (e.g., a suspected security impact). Any gzip, bzip2, or xz compressed files will have their uncompressed content compared only, which will allow changes through in the compression level used. Message catalog files (.mo) are unpacked and compared using diff(1). Public C and C++ header files are preprocessed and compared using diff(1). Any changes with diff output are included in the results.
pt_br: Relata os arquivos alterados da versão anterior para a posterior. Certas alterações no arquivo gerarão avisos adicionais se a preocupação for mais crítica do que apenas relatar alterações (por exemplo, uma suspeita de impacto na segurança). Quaisquer arquivos compactados gzip, bzip2 ou xz terão apenas seu conteúdo descompactado comparado, o que permitirá alterações no nível de compactação utilizado. Os arquivos do catálogo de mensagens (.mo) são descompactados e comparados usando diff(1). Arquivos de cabeçalho públicos C e C++ são pré-processados e comparados usando diff(1). Quaisquer alterações na saída diff são incluídas nos resultados.

source: Report files that have moved installation paths or across subpackages between builds. Files moved with a security path prefix generate special reporting in case a security review is required. Rebased packages report these findings at the INFO level while non-rebased packages report them at the VERIFY level or higher.
pt_br: Relata arquivos que tiveram mudança nos caminhos de instalação ou entre subpacotes entre compilações. Os arquivos movidos com um prefixo de caminho de segurança geram relatórios especiais caso seja necessária uma revisão de segurança. Pacotes rebaseados relatam essas descobertas no nível INFO, enquanto pacotes não rebaseados as relatam no nível VERIFY ou superior.

source: Report removed files from the before build to the after build. Shared libraries get additional reporting output as they may be unexpected dependency removals. Files removed with a security path prefix generate special reporting in case a security review is required. Source RPMs and debuginfo files are ignored by this inspection. Rebased packages report these findings at the INFO level while non-rebased packages report them at the VERIFY level or higher.
pt_br: Relata arquivos removidos da compilação anterior para a compilação posterior. Bibliotecas compartilhadas obtêm resultados de relatórios adicionais, pois podem ser remoções inesperadas de dependências. Arquivos removidos com um prefixo de caminho de segurança geram relatórios especiais caso seja necessária uma revisão de segurança. Os RPMs fonte e os arquivos debuginfo são ignorados por esta inspeção. Pacotes rebaseados relatam essas descobertas no nível INFO, enquanto pacotes não rebaseados as relatam no nível VERIFY ou superior.

source: Report added files from the before build to the after build. Debuginfo files are ignored as are files that match the patterns defined in the configuration file. Files added to security paths generate special reporting in case a security review is required. New setuid and setgid files raise a security warning unless the file is in the fileinfo list. Rebased packages report these findings at the INFO level while non-rebased packages report them at the VERIFY level or higher.
pt_br: Relata arquivos adicionados da compilação anterior para a compilação posterior. Os arquivos Debuginfo são ignorados, assim como os arquivos que correspondem aos padrões definidos no arquivo de configuração. Os arquivos adicionados aos caminhos de segurança geram relatórios especiais caso seja necessária uma revisão de segurança. Novos arquivos setuid e setgid geram um aviso de segurança, a menos que o arquivo esteja na lista fileinfo. Pacotes rebaseados relatam essas descobertas no nível INFO, enquanto pacotes não rebaseados as relatam no nível VERIFY ou superior.

source: Report Source archives defined in the RPM spec file changing content between the before and after build. If the source archives change and the package is on the rebaseable list, the change is reported as informational. Otherwise the change is reported as a rebase of the package and requires inspection.
pt_br: Relata arquivos no Source definidos no arquivo spec RPM alterando o conteúdo entre antes e depois da compilação. Se os arquivos fonte forem alterados e o pacote estiver na lista rebaseável, a alteração será relatada como informativa. Caso contrário, a alteração será relatada como um rebase do pacote e exigirá inspeção.

source: Report files and directories owned by unexpected users and groups. Check to make sure executables are owned by the correct user and group. If a before and after build have been specified, also report ownership changes.
pt_br: Relata arquivos e diretórios pertencentes a usuários e grupos inesperados. Verifica se os executáveis pertencem ao usuário e grupo corretos. Se uma compilação antes e depois tiver sido especificada, relata também as alterações de propriedade.

source: For all shell scripts in the build, perform a syntax check on it using the shell defined in its #! line (shell must also be listed in shell section of the configuration data). If the syntax check returns non-zero, report it to the user and return a combined stdout and stderr. If comparing two builds, perform the previous check but also report if a previously bad script is now passing the syntax check.
pt_br: Para todos os scripts de shell na compilação, executa uma verificação de sintaxe usando o shell definido em sua linha #! (shell também deve ser listado na seção shell dos dados de configuração). Se a verificação de sintaxe retornar diferente de zero, informa ao usuário e retorna uma combinação de stdout e stderr. Se estiver comparando duas compilações, executa a verificação anterior, mas também informa se um script anteriormente incorreto está passando na verificação de sintaxe.

source: Perform annocheck tests defined in the configuration file on all ELF files in the build. A single build specified will perform an analysis only. Two builds specified will compare the test results between the before and after build. If no annocheck tests are defined in the configuration file, this inspection is skipped.
pt_br: Executa testes do annocheck definidos no arquivo de configuração em todos os arquivos ELF na compilação. Uma única compilação especificada executará apenas uma análise. Duas compilações especificadas compararão os resultados do teste entre a compilação anterior e posterior. Se nenhum teste do annocheck estiver definido no arquivo de configuração, esta inspeção será ignorada.

source: Compare DT_NEEDED entries in dynamic ELF executables and shared libraries between the before and after build and report changes.
pt_br: Compara entradas DT_NEEDED em executáveis ELF dinâmicos e bibliotecas compartilhadas entre antes e depois da compilação e relata as alterações.

source: Report file size changes between builds. If empty files became non-empty or non-empty files became empty, report those as results needing verification. Report file change percentages as info-only.
pt_br: Relata alterações no tamanho do arquivo entre compilações. Se os arquivos vazios se tornarem não vazios ou os arquivos não vazios ficarem vazios, relata-os como resultados que precisam de verificação. Relata as porcentagens de alteração do arquivo apenas como informação.

source: Report stat(2) mode changes between builds. Checks against the fileinfo list for the product release specified or determined. Any setuid or setgid changes will raise a message requiring Security Team review.
pt_br: Relata alterações no modo stat(2) entre compilações. Verifica a lista fileinfo da versão do produto especificada ou determinada. Quaisquer alterações no setuid ou setgid gerarão uma mensagem exigindo revisão da equipe de segurança.

source: Report capabilities(7) changes between builds. Checks against the capabilities list for the product release specified or determined. Any capabilities changes not listed will raise a message requiring Security Team review.
pt_br: Relata alterações em capabilities(7) entre compilações. Verifica a lista de recursos da versão do produto especificada ou determinada. Quaisquer alterações de recursos não listadas gerarão uma mensagem exigindo revisão da Equipe de Segurança.

source: Report kernel module parameter, dependency, PCI ID, or symbol differences between builds. This inspection is intended as an information gathering tool to gather kernel module differences between two builds.
pt_br: Relata diferenças de parâmetros em módulo do kernel, de dependência, de ID PCI ou de símbolos entre compilações. Esta inspeção pretende ser uma ferramenta de coleta de informações para coletar diferenças de módulos do kernel entre duas compilações.

source: Report RPM architectures that appear and disappear between the before and after builds. This inspection does not report the loss of noarch packages. The purpose of this inspection is to report the loss of target machine architectures as provided in the before build and not seeing them in the after build.
pt_br: Relata arquiteturas RPM que aparecem e desaparecem entre as compilações antes e depois. Esta inspeção não relata a perda de pacotes noarch. O objetivo desta inspeção é relatar a perda de arquiteturas de máquinas de destino conforme fornecidas na versão anterior e não vê-las na versão posterior.

source: Report RPM subpackages that appear and disappear between the before and after builds.
pt_br: Relata subpacotes RPM que aparecem e desaparecem entre as compilações antes e depois.

source: Ensure packages contain an entry in the %changelog for the version built. Reports any other differences in the existing changelog between builds and that the new entry contains new text entries.
pt_br: Certifica-se de que os pacotes contenham uma entrada no %changelog para a versão criada. Relata quaisquer outras diferenças no changelog existente entre compilações e que a nova entrada contém novas entradas de texto.

source: Report files that are packaged in directories that are no longer used by the product. Usually this means a package has not been updated to account for path migrations. The main examples are /bin migrating to /usr/bin and /sbin migrating to /usr/sbin.
pt_br: Relata arquivos que estão empacotados em diretórios que não são mais usados pelo produto. Geralmente isso significa que um pacote não foi atualizado para dar conta das migrações de caminho. Os principais exemplos são /bin migrando para /usr/bin e /sbin migrando para /usr/sbin.

source: Link Time Optimization (LTO) produces smaller and faster shared ELF executables and libraries. LTO bytecode is not stable from one release of gcc to the next. As such, LTO bytecode should not be present in .a and .o ELF objects shipped in packages. This inspection looks for LTO bytecode in ELF relocatable objects and reports if any is present.
pt_br: Link Time Optimization (LTO) produz executáveis e bibliotecas ELF compartilhadas menores e mais rápidas. O bytecode LTO não é estável de uma versão do gcc para a próxima. Como tal, o bytecode LTO não deve estar presente em objetos ELF .a e .o enviados em pacotes. Esta inspeção procura bytecode LTO em objetos relocáveis ELF e relata se algum estiver presente.

source: Symbolic links must be resolvable on the installed system. This inspection ensures absolute and relative symlinks are valid. It also checks for any symlink usage that will cause problems for RPM.
pt_br: Os links simbólicos devem poder ser resolvidos no sistema instalado. Esta inspeção garante que os links simbólicos absolutos e relativos sejam válidos. Ela também verifica qualquer uso de link simbólico que possa causar problemas ao RPM.

source: Check %files sections in the spec file for any forbidden path references.
pt_br: Verifica as seções %files no arquivo spec para quaisquer referências de caminho proibidas.

source: Compare MIME types of files between builds and report any changes for verification.
pt_br: Compara os tipos de arquivos MIME entre compilações e relate quaisquer alterações para verificação.

source: When comparing two builds or two packages, compare ELF files using abidiff(1) from the libabigail project. Differences are reported. If the package is a rebase and not on the rebaseable list and the rebase inspection is enabled, ABI differences are reported as failures. The assumption here is that rpminspect is comparing builds for maintenance purposes and you do not want to introduce any ABI changes for users. If you do not care about that, turn off the abidiff inspection or add the package name to the rebaseable list.
pt_br: Ao comparar duas compilações ou dois pacotes, compara os arquivos ELF usando abidiff(1) do projeto libabigail. As diferenças são relatadas. Se o pacote for um rebase e não estiver na lista rebaseável e a inspeção de rebase estiver habilitada, as diferenças de ABI serão relatadas como falhas. A suposição aqui é que o rpminspect está comparando compilações para fins de manutenção e você não deseja introduzir nenhuma alteração de ABI para os usuários. Se você não se importa com isso, desative a inspeção abidiff ou adicione o nome do pacote à lista rebaseável.

source: kmidiff compares the binary Kernel Module Interfaces of two Linux kernel trees. The binary KMI is the interface that the Linux kernel exposes to its modules. The trees we are interested in here are the result of the build of the Linux kernel source tree. If the builds compared are not considered a rebase, an incompatible change reported by kmidiff is reported for verification.
pt_br: kmidiff compara as interfaces binárias do módulo do kernel de duas árvores do kernel Linux. O binário KMI é a interface que o kernel do Linux expõe aos seus módulos. As árvores nas quais estamos interessados aqui são o resultado da compilação da árvore fonte do kernel Linux. Se as compilações comparadas não forem consideradas um rebase, uma alteração incompatível reportada pelo kmidiff será reportada para verificação.

source: Check for and report differences in configuration files marked with %config in the spec file. If changes are whitespace or formatting only, the result is reported at the INFO level. Content and location changes are reporting at the VERIFY level unless the comparison is between rebased packages.
pt_br: Verifica e relata diferenças nos arquivos de configuração marcados com %config no arquivo spec. Se as alterações forem apenas espaços em branco ou formatação, o resultado será relatado no nível INFO. As alterações de conteúdo e localização são relatadas no nível VERIFY, a menos que a comparação seja entre pacotes rebaseados.

source: Report changes in %doc marked files. Files that have been added or removed as documentation files, for instance.
pt_br: Relata alterações em arquivos marcados com %doc. Arquivos que foram adicionados ou removidos como arquivos de documentação, por exemplo.

source: Inspects all patches defined in the spec file and reports changes between builds. The functional check here is to ensure all defined patches in the preamble have a corresponding application macro in the spec file. At the INFO level, rpminspect reports file count, line count, and patch size changes. If thresholds are reached regarding a change in the patch size or the number of files the patch touches, rpminspect reports the change at the VERIFY level unless the comparison is for a rebase. The configuration file can also list patch names that rpminspect should ignore during the inspection.
pt_br: Inspeciona todos os patches definidos no arquivo spec e relata alterações entre compilações. A verificação funcional aqui é garantir que todos os patches definidos no preâmbulo tenham uma macro de aplicativo correspondente no arquivo spec. No nível INFO, o rpminspect relata a contagem de arquivos, a contagem de linhas e as alterações no tamanho do patch. Se os limites forem atingidos em relação a uma mudança no tamanho do patch ou no número de arquivos que o patch toca, o rpminspect relata a mudança no nível VERIFY, a menos que a comparação seja para um rebase. O arquivo de configuração também pode listar nomes de patches que o rpminspect deve ignorar durante a inspeção.

source: Performs a virus scan on every file in the build using libclamav. Anything found by libclamav will fail the inspection. The ignore_path rules are not used in this inspection. All files are scanned.
pt_br: Executa uma verificação de vírus em todos os arquivos da compilação usando libclamav. Qualquer coisa encontrada por libclamav falhará na inspeção. As regras ignore_path não são usadas nesta inspeção. Todos os arquivos são verificados.

source: Check for known politically sensitive files in packages and report if they are allowed or prohibited. The rules come from the politics/ subdirectory in the rpminspect-data package for the product. Files in politics/ subdirectory map to the product release string. The rules in each file define the politically sensitive allow and deny rules for that release.
pt_br: Verifica se há arquivos politicamente sensíveis nos pacotes e informe se eles são permitidos ou proibidos. As regras vêm do subdiretório politics/ no pacote rpminspect-data do produto. Os arquivos no subdiretório politics/ são mapeados para a sequência de lançamento do produto. As regras em cada arquivo definem as regras de permissão e negação politicamente sensíveis para esse lançamento.

source: Check for forbidden functions in ELF files. Forbidden functions are defined in the runtime configuration files. Usually this inspection is used to catch built packages that make use of deprecated API functions if you wish built packages to conform to replacement APIs.
pt_br: Verifica se há funções proibidas em arquivos ELF. As funções proibidas são definidas nos arquivos de configuração de tempo de execução. Normalmente esta inspeção é usada para capturar pacotes construídos que fazem uso de funções de API descontinuadas se você deseja que os pacotes construídos estejam em conformidade com APIs de substituição.

source: Check for forbidden paths in both the DT_RPATH and DT_RUNPATH settings in ELF shared objects.
pt_br: Verifica caminhos proibidos nas configurações DT_RPATH e DT_RUNPATH em objetos ELF compartilhados.
