Repository: rffontenelle/rpminspect-l10n
Catalog: *.po
Languages: pt_br

source: Package Build Host "%s" is not within an expected build host subdomain in %s
pt_br: O host de compilação do pacote "%s" não está em um subdomínio esperado do host de compilação em %s

source: invalid build host ${FILE} on ${ARCH}
pt_br: host de compilação inválido ${FILE} em ${ARCH}

source: Package Summary contains unprofessional language in %s
pt_br: O resumo do pacote contém linguagem não profissional em %s

source: Summary: %s
pt_br: Resumo: %s

source: Summary contains unprofessional words on ${ARCH}
pt_br: O resumo contém palavras não profissionais em ${ARCH}

source: Package Description contains unprofessional language in %s:
pt_br: A descrição do pacote contém linguagem não profissional em %s:

source: Description contains unprofessional words on ${ARCH}
pt_br: A descrição contém palavras não profissionais em ${ARCH}

source: Gained Package Vendor "%s" in %s
pt_br: Ganhou fornecedor do pacote "%s" em %s

source: Lost Package Vendor "%s" in %s
pt_br: Perdeu fornecedor do pacote "%s" em %s

source: Package Vendor changed from "%s" to "%s" in %s
pt_br: Fornecedor do pacote alterado de "%s" para "%s" em %s

source: Package Summary change from "%s" to "%s" in %s
pt_br: Mudança no resumo do pacote de "%s" para "%s" em %s

source: Package Description changed in %s
pt_br: Descrição do pacote alterada em %s

source: from: %s to: %s
pt_br: de: %s para: %s

source: The /data/static_context value in %s is %s, but the product release rules forbid the presence of /data/static_context in the module metadata.
pt_br: O valor de /data/static_context em %s é %s, mas as regras de lançamento do produto proíbem a presença de /data/static_context nos metadados do módulo.

source: The /data/static_context value in %s is %s, but the product release rules require the presence of /data/static_context in the module metadata.
pt_br: O valor de /data/static_context em %s é %s, mas as regras de lançamento do produto exigem a presença de /data/static_context nos metadados do módulo.

source: The /data/static_context value in %s is %s, but the product release rules recommend the presence of /data/static_context in the module metadata.
pt_br: O valor de /data/static_context em %s é %s, mas as regras de lançamento do produto recomendam a presença de /data/static_context nos metadados do módulo.

source: The /data/static_context value in %s is %s, and the product release rules do not have a setting for /data/static_context in the module metadata.
pt_br: O valor de /data/static_context em %s é %s e as regras de lançamento do produto não têm uma configuração para /data/static_context nos metadados do módulo.

source: The /data/static_context value in %s is %s as required by the product release rules.
pt_br: O valor /data/static_context em %s é %s conforme exigido pelas regras de lançamento do produto.

source: %s The /data/static_context value is the same as in %s.
pt_br: %s O valor de /data/static_context é o mesmo que em %s.

source: %s The /data/static_context value has changed since %s.
pt_br: %s O valor de /data/static_context mudou desde %s.

source: Package "%s" is part of a module but lacks the '%%{modularitylabel}' header tag.
pt_br: O pacote "%s" faz parte de um módulo, mas não possui a tag de cabeçalho '%%{modularitylabel}'.

source: Inspection skipped because this build's type is not `module'.
pt_br: A inspeção foi ignorada porque o tipo desta compilação não é `module'.

source: %s moved to ${FILE} on ${ARCH}
pt_br: %s mudou para ${FILE} em ${ARCH}

source: %s probably moved to %s on %s
pt_br: %s provavelmente mudou para %s em %s

source: File %s has forbidden owner `%s` on %s
pt_br: O arquivo %s tem o proprietário proibido `%s` em %s

source: forbidden owner for ${FILE} on ${ARCH}
pt_br: proprietário proibido para ${FILE} em ${ARCH}

source: File %s has forbidden group `%s` on %s
pt_br: O arquivo %s tem o grupo proibido `%s` em %s

source: forbidden group for ${FILE} on ${ARCH}
pt_br: grupo proibido para ${FILE} em ${ARCH}

source: File %s has owner `%s` on %s, but should be `%s`
pt_br: O arquivo %s tem proprietário `%s` em %s, mas deveria ser `%s`

source: invalid owner for ${FILE} on ${ARCH}
pt_br: proprietário inválido para ${FILE} em ${ARCH}

source: File %s on %s has CAP_SETUID capability but group `%s` and is world executable
pt_br: O arquivo %s em %s tem capacidade CAP_SETUID, mas grupo `%s` e é executável por todos

source: CAP_SETUID and o+x for ${FILE} on ${ARCH}
pt_br: CAP_SETUID e o+x para ${FILE} em ${ARCH}

source: File %s on %s has CAP_SETUID capability but group `%s` and is group writable
pt_br: O arquivo %s em %s tem capacidade CAP_SETUID, mas grupo `%s` e é gravável para o grupo

source: CAP_SETUID and g+w for ${FILE} on ${ARCH}
pt_br: CAP_SETUID e g+w para ${FILE} em ${ARCH}

source: File %s has group `%s` on %s, but should be `%s`
pt_br: O arquivo %s tem o grupo `%s` em %s, mas deveria ser `%s`

source: invalid group for ${FILE} on ${ARCH}
pt_br: grupo inválido para ${FILE} em ${ARCH}

source: File %s changed %s from `%s` to `%s` on %s
pt_br: O arquivo %s mudou %s de `%s` para `%s` em %s

source: ${FILE} changed owner on ${ARCH}
pt_br: ${FILE} mudou de proprietário em ${ARCH}

source: Patch number %ld (%s) is missing a corresponding %%patch%ld macro, usually in %%prep.
pt_br: O patch de número %ld (%s) carece de uma macro %%patch%ld correspondente, geralmente em %%prep.

source: missing %%patch macro for ${FILE}
pt_br: macro de %%patch faltando para ${FILE}

source: Patch number %ld (%s) is mismatched with %%patch%ld macro.
pt_br: O patch de número %ld (%s) não corresponde à macro %%patch%ld.

source: mismatched %%patch macro for ${FILE}
pt_br: macro %%patch incompatível para ${FILE}

source: undefined Patch ${FILE}
pt_br: Patch indefinido ${FILE}

source: Undefined Patch file %s.
pt_br: Arquivo de patch indefinido %s.

source: *** unable to uncompress patch: %s
pt_br: *** não foi possível descompactar patch: %s

source: corrupt patch ${FILE}
pt_br: patch corrompido ${FILE}

source: Patch %s is under 4 bytes in size - is it corrupt?
pt_br: O patch %s tem menos de 4 bytes de tamanho - está corrompido?

source: %s changed (%ld bytes -> %ld bytes)
pt_br: %s alterado (%ld bytes -> %ld bytes)

source: patch file ${FILE}
pt_br: arquivo patch ${FILE}

source: New patch file `%s` appeared
pt_br: Novo arquivo de patch `%s` apareceu

source: patch changes ${FILE}
pt_br: patch altera ${FILE}

source: %s touches as many as %ld line%s
pt_br: %s toca até %ld linha%s

source: %s touches %ld file%s
pt_br: %s toca %ld arquivo%s

source: %s touches %ld file%s and %s%ld line%s
pt_br: %s toca %ld arquivo%s e %s%ld linha%s

source: as many as
pt_br: até

source: No source packages available, skipping inspection.
pt_br: Nenhum pacote fonte disponível, ignorando a inspeção.

source: Unhandled patch file `%s` defined in spec file
pt_br: Arquivo de patch `%s` não tratado definido no arquivo spec

source: *** unrecognized %%patch line: %s
pt_br: *** linha %%patch não reconhecida: %s

source: *** unable to read spec file line: %s
pt_br: *** não foi possível ler a linha do arquivo spec: %s

source: Patch file `%s` removed
pt_br: Arquivo de patch `%s` removido

source: File %s found should be in %s on %s
pt_br: O arquivo %s encontrado deveria estar em %s em %s

source: ${FILE} should be in %s on ${ARCH}
pt_br: ${FILE} deveria estar em %s em ${ARCH}

source: changed setuid/setgid;
pt_br: mudou setuid/setgid;

source: became a directory;
pt_br: se tornou um diretório;

source: became a character device;
pt_br: se tornou um dispositivo de caractere;

source: became a block device;
pt_br: se tornou um dispositivo de bloco;

source: became a regular file;
pt_br: se tornou um arquivo regular;

source: became a FIFO;
pt_br: se tornou um FIFO;

source: became a symbolic link;
pt_br: se tornou um link simbólico;

source: became a socket;
pt_br: se tornou um socket;

source: permissions
pt_br: permissões

source: relaxed
pt_br: relaxadas

source: changed
pt_br: alteradas

source: %s from %04o to %04o on %s
pt_br: %s de %04o para %04o em %s

source: ${FILE} permissions from %04o to %04o on ${ARCH}
pt_br: Permissões de ${FILE} de %04o para %04o em ${ARCH}

source: %s (%s) is world-writable on %s
pt_br: %s (%s) é gravável por todos em %s

source: ${FILE} is world-writable on ${ARCH}
pt_br: ${FILE} é gravável por todos em ${ARCH}

source: *** invalid politics entry with pattern=%s and digest=%s
pt_br: *** entrada de políticas inválida com pattern=%s e digest=%s

source: *** unknown digest type for pattern %s: %s
pt_br: *** tipo de digest desconhecido para pattern %s: %s

source: Possible politically sensitive file (%s) found in %s on %s: rules allow this file.
pt_br: Possível arquivo politicamente sensível (%s) encontrado em %s em %s: as regras permitem este arquivo.

source: Possible politically sensitive file (%s) found in %s on %s: rules prohibit this file.
pt_br: Possível arquivo politicamente sensível (%s) encontrado em %s em %s: as regras proíbem este arquivo.

source: ${FILE} is politically sensitive
pt_br: ${FILE} é politicamente sensível

source: ; Removing security policy related files requires inspection by the Security Response Team.
pt_br: ; A remoção de arquivos relacionados à política de segurança requer inspeção pela Equipe de Resposta de Segurança.

source: library ${FILE} removed on ${ARCH}
pt_br: biblioteca ${FILE} removida em ${ARCH}

source: ABI break: Library %s with SONAME '%s' removed from %s
pt_br: Quebra de ABI: Biblioteca %s com SONAME '%s' removido de %s

source: missing SONAME in ${FILE} on ${ARCH}
pt_br: faltando SONAME em ${FILE} em ${ARCH}

source: ABI break: Library %s removed from %s
pt_br: Quebra de ABI: Biblioteca %s removida de %s

source: %s removed from %s
pt_br: %s removido de %s

source: Invalid looking %s dependency in the %s package on %s: %s
pt_br: Dependência %s com aparência de inválida no pacote %s em %s: %s

source: '${FILE}' in %s on ${ARCH}
pt_br: '${FILE}' em %s em ${ARCH}

source: Subpackage %s on %s carries '%s' which comes from subpackage %s but does not carry an explicit package version requirement. Please add 'Requires: %s = %s' to the spec file to avoid the need to test interoperability between various combinations of old and new subpackages.
pt_br: O subpacote %s em %s carrega '%s' que vem do subpacote %s mas não carrega um requisito explícito de versão do pacote. Adicione 'Requires: %s = %s' ao arquivo spec para evitar a necessidade de testar a interoperabilidade entre várias combinações de subpacotes novos e antigos.

source: missing 'Requires: ${FILE} = %s' in %s on ${ARCH}
pt_br: faltando 'Requires: ${FILE} = %s' em %s em ${ARCH}

source: Multiple subpackages provide '%s': [%s] but these subpackages carry explicit Requires: [%s]
pt_br: Vários subpacotes fornecem '%s': [%s], mas esses subpacotes carregam Requires explícito: [%s]

source: %s all provide '${FILE}' on ${ARCH}
pt_br: %s todos fornecem '${FILE}' em ${ARCH}

source: Missing epoch prefix on the version-release in '%s' for %s on %s
pt_br: Faltando o prefixo de epoch no version-release em '%s' para %s em %s

source: '${FILE}' needs epoch in %s on ${ARCH}
pt_br: '${FILE}' precisa de epoch em %s em ${ARCH}

source: spec file
pt_br: arquivo spec

source: Gained '%s' in source package %s
pt_br: Ganhou '%s' no pacote fonte %s

source: Gained '%s' in subpackage %s on %s
pt_br: Ganhou '%s' no subpacote %s em %s

source: Retained '%s' in source package %s
pt_br: Retido '%s' no pacote fonte %s

source: Retained '%s' in subpackage %s on %s
pt_br: Retido '%s' no subpacote %s em %s

source: Changed '%s' to '%s' in source package %s
pt_br: Alterado '%s' para '%s' no pacote fonte %s

source: Changed '%s' to '%s' in subpackage %s on %s
pt_br: Alterado '%s' para '%s' no subpacote %s em %s

source: '%s' became '${FILE}' in %s on ${ARCH}
pt_br: '%s' tornou-se '${FILE}' em %s em ${ARCH}

source: ; this is expected
pt_br: ; isso é esperado

source: Lost '%s' in source package %s
pt_br: Perdeu '%s' no pacote fonte %s

source: Lost '%s' in subpackage %s on %s
pt_br: Perdeu '%s' no subpacote %s em %s

source: *** unable to compile $ORIGIN root prefix regular expression: %s
pt_br: *** não foi possível compilar a expressão regular do prefixo raiz $ORIGIN: %s

source: %s has an invalid-looking %s on %s: %s
pt_br: %s tem um %s de aparência inválida em %s: %s

source: runtime search path in ${FILE} on ${ARCH}
pt_br: caminho de pesquisa do runtime em ${FILE} em ${ARCH}

source: both DT_RPATH and DT_RUNPATH in ${FILE} on ${ARCH}
pt_br: ambos DT_RPATH e DT_RUNPATH em ${FILE} em ${ARCH}

source: %s has both DT_RPATH and DT_RUNPATH on %s; this is not allowed
pt_br: %s tem DT_RPATH e DT_RUNPATH em %s; isso não é permitido

source: invalid shell script ${FILE} on ${ARCH}
pt_br: script de shell inválido ${FILE} em ${ARCH}

source: %s is a shell script but was not before on %s
pt_br: %s é um script de shell, mas não existia antes em %s

source: %s is a %s script but was a %s script before on %s
pt_br: %s é um script %s, mas já era um script %s antes em %s

source: %s is no longer a valid %s script on %s
pt_br: %s não é mais um script %s válido em %s

source: %s became a valid %s script on %s
pt_br: %s tornou-se um script %s válido em %s

source: . The script fails with '-n' but passes with '-O extglob'; be sure 'shopt extglob' is set in the script.
pt_br: . O script falha com '-n', mas passa com '-O extglob'; certifique-se de que 'shopt extglob' esteja definido no script.

source: %s is not a valid %s script on %s
pt_br: %s não é um script %s válido em %s

source: %s fails with '-n' but passes with '-O extglob'; be sure 'shopt extglob' is set in the script on %s
pt_br: %s falha com '-n' mas passa com '-O extglob'; certifique-se de que 'shopt extglob' esteja definido no script em %s

source: unexpected spec filename
pt_br: nome de arquivo spec inesperado

source: exactly match
pt_br: corresponde exatamente

source: begin with
pt_br: começa com

source: end with
pt_br: termina com

source: Spec filename does not %s the primary name %s; got '%s'
pt_br: O nome do arquivo spec não é %s o nome primário %s; obteve '%s'

source: The specname inspection is only for source packages, skipping.
pt_br: A inspeção de specname é apenas para pacotes fonte, ignorando.

source: Subpackage '%s' has disappeared on '%s'
pt_br: O subpacote '%s' desapareceu em '%s'

source: subpackage ${FILE}
pt_br: subpacote ${FILE}

source: Subpackage '%s' has appeared on '%s'
pt_br: O subpacote '%s' apareceu em '%s'

source: Directory %s became a symbolic link (to %s) in %s on %s; this is not allowed!
pt_br: O diretório %s tornou-se um link simbólico (para %s) em %s em %s; isso não é permitido!

source: %s %s became a symbolic link (to %s) in %s on %s
pt_br: %s %s tornou-se um link simbólico (para %s) em %s em %s

source: ${FILE} became a symlink on ${ARCH}
pt_br: ${FILE} tornou-se um link simbólico em ${ARCH}

source: unable to read symlink ${FILE} on ${ARCH}
pt_br: não é possível ler o link simbólico ${FILE} em ${ARCH}

source: An error occurred reading symbolic link %s in %s on %s.
pt_br: Ocorreu um erro ao ler o link simbólico %s em %s em %s.

source: %s %s has too many levels of redirects and cannot be resolved in %s on %s
pt_br: %s %s tem muitos níveis de redirecionamentos e não pode ser resolvido em %s em %s

source: too many redirects for ${FILE} on ${ARCH}
pt_br: muitos redirecionamentos para ${FILE} em ${ARCH}

source: %s %s %s a dangling symbolic link in %s on %s
pt_br: %s %s %s um link simbólico pendente em %s em %s

source: dangling symlink ${FILE} on ${ARCH}
pt_br: link simbólico pendente ${FILE} em ${ARCH}

source: ${FILE} MIME type on ${ARCH}
pt_br: Tipo MIME de ${FILE} em ${ARCH}

source: Unknown MIME type `%s' on %s in %s
pt_br: Tipo MIME desconhecido `%s' em %s em %s

source: MIME type for %s in %s was `%s/%s' and became `%s/%s'
pt_br: O tipo MIME para %s em %s era `%s/%s' e se tornou `%s/%s'

source: %s is a valid udev rules file on %s
pt_br: %s é um arquivo válido de regras do udev em %s

source: %s is now a valid udev rules file on %s
pt_br: %s agora é um arquivo válido de regras do udev em %s

source: %s is no longer a valid udev rules file on %s
pt_br: %s não é mais um arquivo válido de regras do udev em %s

source: %s is not a valid udev rules file on %s
pt_br: %s não é um arquivo válido de regras do udev em %s

source: *** empty localpath on %s
pt_br: *** localpath vazio em %s

source: forbidden code point in ${FILE} on ${ARCH}
pt_br: ponto de código proibido em ${FILE} em ${ARCH}

source: A forbidden code point, 0x%04X, was found in the %s source file on line %ld at column %ld. This source file is used by %s.
pt_br: Um ponto de código proibido, 0x%04X, foi encontrado no arquivo fonte %s na linha %ld na coluna %ld. Este arquivo fonte é usado por %s.

source: unable to run %prep in ${FILE}
pt_br: não é possível executar %prep em ${FILE}

source: Unable to run through the %%prep section in %s or manually unpack sources for further scanning.
pt_br: Não é possível executar a seção %%prep em %s ou descompactar manualmente as fontes para verificação adicional.

source: The unicode inspection is only for source packages, skipping.
pt_br: A inspeção unicode é apenas para pacotes fonte, ignorando.

source: New upstream source file `%s` appeared
pt_br: Novo arquivo fonte upstream `%s` apareceu

source: new source file ${FILE}
pt_br: novo arquivo fonte ${FILE}

source: Upstream source file `%s` changed content
pt_br: O arquivo fonte upstream `%s` alterou o conteúdo

source: checksum of ${FILE}
pt_br: soma de verificação de ${FILE}

source: Source file `%s` removed
pt_br: Arquivo fonte `%s` removido

source: source file ${FILE} removed
pt_br: arquivo fonte ${FILE} removido

source: *** cl_engine_new returned NULL, check clamav library
pt_br: *** cl_engine_new retornou NULL, verifique a biblioteca do clamav

source: Virus detected in %s in the %s package on %s: %s
pt_br: Vírus detectado em %s no pacote %s em %s: %s

source: clamav version information
pt_br: informações da versão do clamav

source: clamav version %s
pt_br: clamav versão %s

source: *** missing %s
pt_br: *** faltando %s

source: %s version %u (%s)
pt_br: %s versão %u (%s)

source: virus or malware in ${FILE} on ${ARCH}
pt_br: vírus ou malware em ${FILE} em ${ARCH}

source: %s is a well-formed XML file in %s on %s, but is not a valid XML file
pt_br: %s é um arquivo XML bem formado em %s em %s, mas não é um arquivo XML válido

source: %s is not a well-formed XML file in %s on %s
pt_br: %s não é um arquivo XML bem formado em %s em %s

source: ${FILE} is not well-formed XML on ${ARCH}
pt_br: ${FILE} não é um XML bem formado em ${ARCH}

source: *** XML-RPC Fault: %s (%d)
pt_br: *** Falha no XML-RPC: %s (%d)

source: *** xmlrpc fault code %s (%d): getBuild(%s) from %s
pt_br: *** código de falha xmlrpc %s (%d): getBuild(%s) de %s

source: *** Koji build state is %s for %s, cannot continue
pt_br: *** O estado da compilação do Koji é %s para %s, não é possível continuar

source: *** xmlrpc fault code %s (%d): getTaskInfo(%s) from %s
pt_br: *** código de falha xmlrpc %s (%d): getTaskInfo(%s) de %s

source: *** Koji task state is %s for task %s, cannot continue
pt_br: *** O estado de tarefa do Koji é %s para a tarefa %s, não é possível continuar

source: RPM package build
pt_br: Compilação de pacote RPM

source: Module build consisting of multiple RPM package builds
pt_br: Compilação de módulo que consiste em múltiplas compilações de pacotes RPM

source: *** unable to initialize the magic library
pt_br: *** não foi possível inicializar a biblioteca mágica

source: *** unable to load the magic database: %s
pt_br: *** não foi possível carregar o banco de dados mágico: %s

source: *** unable to mkdir %s
pt_br: *** não foi possível fazer mkdir %s

source: Detailed results suitable for the console and piping through paging programs.
pt_br: Resultados detalhados adequados para o console e canalização por meio de programas de paginação.

source: Results organized as a JSON data structure suitable for reading by web applications and other frontend tools.
pt_br: Resultados organizados como uma estrutura de dados JSON adequada para leitura por aplicações web e outras ferramentas frontend.

source: Results organized as an XUnit data structure suitable for use with Jenkins and other XUnit-enabled services.
pt_br: Resultados organizados como uma estrutura de dados XUnit adequada para uso com Jenkins e outros serviços habilitados para XUnit.

source: Results summarized with one result per line, suitable for console viewing with a paging program.
pt_br: Resultados resumidos com um resultado por linha, adequado para visualização em console com um programa de paginação.

source: *** error opening %s for writing
pt_br: *** erro ao abrir %s para escrita

source: added
pt_br: adicionado

source: removed
pt_br: removido

source: changed
pt_br: alterado

source: unknown
pt_br: desconhecido

source: Result: %s
pt_br: Resultado: %s

source: *** unable to close %s
pt_br: *** não foi possível fechar %s

source: *** %s is not a directory
pt_br: *** %s não é um diretório

source: *** Fopen failed for %s: %s
pt_br: *** Fopen falhou para %s: %s

source: *** file index %d is out of bounds for %s
pt_br: *** o índice de arquivo %d está fora dos limites para %s

source: *** error reading file from RPM payload
pt_br: *** erro ao ler arquivo da carga útil RPM

source: %s %s tried to run the command and it received signal %s
pt_br: %s %s tentou executar o comando e recebeu o sinal %s

source: %s tried to run the command and it received signal %s
pt_br: %s tentou executar o comando e recebeu o sinal %s

source: NULL
pt_br: NULO

source: VERIFY
pt_br: VERIFICAR

source: BAD
pt_br: INVÁLIDO

source: SKIP
pt_br: PULAR

source: DIAGNOSTICS
pt_br: DIAGNÓSTICO

source: UnKnOwN
pt_br: DeScoNhEcidO

source: Security
pt_br: Segurança

source: regular file
pt_br: arquivo regular

source: directory
pt_br: diretório

source: character device
pt_br: dispositivo de caractere

source: block device
pt_br: dispositivo de bloco

source: FIFO (named pipe)
pt_br: FIFO (pipe nomeado)

source: symbolic link
pt_br: link simbólico

source: Success.
pt_br: Sucesso.

source: One or more inspections failed.
pt_br: Uma ou mais inspeções falharam.

source: Program error.
pt_br: Erro no programa.

source: The specified profile is not found.
pt_br: O perfil especificado não foi encontrado.

source: Insufficient disk space in the working directory.
pt_br: Espaço em disco insuficiente no diretório de trabalho.

source: Compare package builds for policy compliance and consistency.
pt_br: Compara compilações de pacotes para conformidade e consistência de políticas.

source: Usage: %s [OPTIONS] [before build] [after build]
pt_br: Uso: %s [OPÇÕES] [antes da compilação] [depois da compilação]

source: Options:
pt_br: Opções:

source: See the rpminspect(1) man page for more information.
pt_br: Consulte a página man rpminspect(1) para obter mais informações.

source: *** unable to compile product release regular expression: %s
pt_br: *** não foi possível compilar a expressão regular de lançamento do produto: %s

source: *** product release for after build (%s) is empty
pt_br: *** o lançamento do produto após a compilação (%s) está vazio

source: *** product release for before build (%s) is empty
pt_br: *** o lançamento do produto antes da compilação (%s) está vazio

source: *** unable to determine product release for %s and %s
pt_br: *** não foi possível determinar o lançamento do produto para %s e %s

source: *** See the 'favor_release' setting in the rpminspect configuration file.
pt_br: *** Veja a configuração 'favor_release' no arquivo de configuração do rpminspect.

source: *** the -T and -E options are mutually exclusive
pt_br: *** as opções -T e -E são mutuamente exclusivas
