Repository: rffontenelle/rpminspect-l10n
Catalog: *.po
Languages: pt_br

source: *** See `%s --help` for more information.
pt_br: *** Veja `%s --help` para mais informações.

source: *** unknown inspection: `%s`
pt_br: *** inspeção desconhecida: `%s`

source: *** unsupported build type: `%s`.
pt_br: *** tipo de compilação não suportado: `%s`.

source: *** invalid build type: `%s`.
pt_br: *** tipo de compilação inválido: `%s`.

source: *** invalid output format: `%s`.
pt_br: *** formato de saída inválido: `%s`.

source: *** unable to expand working directory: `%s`
pt_br: *** não foi possível expandir o diretório de trabalho: `%s`

source: *** unable to use `%s' as working directory
pt_br: *** não foi possível usar `%s' como diretório de trabalho

source: %s version %s
pt_br: %s versão %s

source: *** ?? getopt returned character code 0%o ??
pt_br: *** ?? getopt retornou o código de caractere 0%o ??

source: Available build types:
pt_br: Tipos de compilação disponíveis:

source: Available output formats:
pt_br: Formatos de saída disponíveis:

source: Available inspections:
pt_br: Inspeções disponíveis:

source: *** failed to read configuration file %s
pt_br: *** falha ao ler o arquivo de configuração %s

source: *** Please specify a configuration file using '-c' or supply ./%s
pt_br: *** Especifique um arquivo de configuração usando '-c' ou forneça ./%s

source: *** Invalid before and after build specification.
pt_br: *** Especificação inválida de antes e depois da compilação.

source: *** unable to read RPM configuration
pt_br: *** não foi possível ler a configuração RPM

source: *** unsupported architecture specified: `%s`
pt_br: *** arquitetura não suportada especificada: `%s`

source: *** unable to create directory %s
pt_br: *** não foi possível criar diretório %s

source: Version information for libraries and programs used by %s as well as storage requirements. This result is for informational and diagnostic purposes only.
pt_br: Informações sobre versões de bibliotecas e programas usados por %s, bem como requisitos de armazenamento. Este resultado é apenas para fins informativos e de diagnóstico.

source: Space required to download artifacts: %lu bytes (%s)
pt_br: Espaço necessário para baixar artefatos: %lu bytes (%s)

source: Space required to unpack artifacts: %lu bytes (%s)
pt_br: Espaço necessário para descompactar artefatos: %lu bytes (%s)

source: Command line arguments used to invoke %s.
pt_br: Argumentos de linha de comando usados para invocar %s.

source: Local configuration file: %s
pt_br: Arquivo de configuração local: %s

source: Before Build
pt_br: Antes da compilação

source: After Build
pt_br: Depois da compilação

source: Build
pt_br: Compilação

source: *** no peers, ensure packages exist for specified architecture(s)
pt_br: *** sem pares, certifique-se de que existam pacotes para arquitetura(s) especificada(s)

source: *** unable to find a set of peer packages between the before and after builds
pt_br: *** incapaz de encontrar um conjunto de pacotes pares entre as compilações antes e depois

source: *** unable to determine product release or none specified (-r).
pt_br: *** não foi possível determinar o lançamento do produto ou nenhum especificado (-r).

source: Skipping %s inspection...
pt_br: Ignorando a inspeção de %s...

source: skip
pt_br: ignorada

source: Running %s inspection...
pt_br: Executando inspeção %s...

source: pass
pt_br: passou

source: FAIL
pt_br: FALHOU

source: Keeping working directory: %s
pt_br: Mantendo o diretório de trabalho: %s
